00
295|250
997|428
427|599
250|401
276|707
414|411
250.02|401
584|403
715|401
496|998
567|707
786|250
427|427
401|593
843|727
285|208
285|250
401|250
788|401
577|250
428|263
276|278
780|250.8
707|599
414|401
424|250
250|535
250|272
284|250.01
414|305
V10|493
428|428
250.01|277
788|596
599|285
411|V45
496|41
998|250
784|401
304|250.02
V43|250
595|E879
413|276
491|250
411|250
413|E885
427|585
577|174
730|731
292|304
280|578
293|403
272|250
250|V42
599|250.82
276|E932
196|198
70|402
272|401
414|414
428|403
414|530
428|427
41|V09
250.6|357
511|532
730|707
492|427
414|250
288|731
595|41
428|425
433|250.81
428|727
568|250
263|305
401|?
300|278
295|491
585|996
780|276
276|401
250.8|473
729|458
427|396
584|278
425|204
424|342
197|197
427|276
648|V27
786|585
276|599
196|401
278|401
682|8
276|428
276|276
250.01|584
427|412
E880|916
276|794
284|786
493|278
491|V46
250|402
486|511
584|599
425|403
707|682
996|411
402|414
276|518
427|284
785|707
V42|599
403|V45
425|337
305|250
486|250.03
593|V15
599|591
403|535
682|401
250.01|238
276|415
787|250
585|428
411|276
250.01|244
515|496
428|496
558|V15
428|250
791|41
780|599
920|924
403|276
403|585
425|427
491|780
427|428
280|285
285|458
276|?
250|311
250|305
518|584
401|414
785|518
250.8|?
413|250
496|427
424|414
413|278
276|250
707|427
507|250.02
682|707
682|584
250.02|278
276|293
577|276
411|424
496|424
250.01|428
585|496
411|428
576|250
719|780
599|250
250.02|428
8|584
496|428
41|250
276|250.02
V45|401
428|250.4
398|285
?|?
491|250.02
414|V45
729|250
536|530
722|722
276|787
491|242
599|403
276|280
682|242
250|?
573|250.01
308|250
250.52|250.6
276|424
272|278
491|276
726|716
816|41
197|198
784|V12
427|250.92
276|584
285|599
519|250
786|255
410|585
250.01|571
427|250
250.02|780
250|414
433|250
998|585
280|996
731|730
789|572
578|403
485|599
585|V45
786|V49
496|414
410|401
584|276
455|280
414|272
253|562
427|473
707|378
428|340
496|250.01
496|788
250.02|342
989|414
E942|250.4
38|404
202|250.02
211|455
403|E888
496|250
285|E885
998|998
446|813
250.5|250.4
413|411
511|427
574|70
599|276
250.82|707
276|791
486|599
E888|250
518|553
427|493
682|250.02
722|564
427|280
465|V58
70|789
276|V18
250.01|412
424|401
278|250
780|311
428|786
707|785
276|466
415|560
427|707
785|681
585|403
8|203
428|486
496|780
518|784
V45|250
413|493
736|250
491|V10
411|203
733|424
250.41|583
599|V45
411|427
196|515
425|411
424|204
496|162
V10|401
70|414
947|E861
784|368
560|250
401|285
401|244
428|396
428|424
491|428
507|427
511|515
682|427
342|250
535|716
276|458
780|782
710|701
782|799
530|714
569|305
584|428
276|V12
780|780
493|276
276|357
276|790
682|250
428|250.02
250|715
493|235
250.4|787
427|401
788|V43
438|736
577|401
196|574
599|250.01
491|250.92
401|V10
276|295
428|250.01
599|287
250.92|272
411|401
425|578
496|707
486|491
518|530
V58|8
780|788
427|682
296|250
427|238
413|585
718|250
518|250.6
250.12|304
425|401
427|285
250.01|309
434|250.02
722|401
593|250
311|250
574|305
250.82|428
463|?
491|401
250.02|285
518|250
276|873
250.03|276
780|401
425|428
250.01|150
285|250.6
435|428
453|198
496|413
428|416
493|780
276|305
287|414
599|788
242|V54
38|780
401|272
250.01|401
276|250.03
786|401
599|425
413|998
568|311
493|250
496|412
493|250.02
496|272
427|425
486|250
412|V12
564|250.6
424|138
250.01|593
153|250.81
191|599
250|530
585|238
726|726
592|250
V45|?
250.01|V15
E942|280
428|413
250.02|41
250|V12
162|197
996|403
250.01|414
998|428
427|441
295|305
438|250
496|280
599|555
682|458
788|250
348|276
401|512
427|305
289|287
530|250
996|V42
682|745
250|V58
427|411
707|94
595|276
152|707
410|414
401|412
276|427
585|250
427|724
285|V43
648|647
V45|412
530|V12
425|585
560|788
V12|401
437|780
746|401
571|250
250.6|518
185|562
420|402
425|250.02
305|305
V42|425
599|996
486|584
425|414
250|319
780|V10
250.52|250.7
493|287
276|197
250|389
287|428
285|780
805|401
285|427
276|403
428|401
250.6|337
276|285
E878|401
428|288
284|196
427|491
403|427
787|724
404|276
411|414
569|250
710|250
577|V15
424|428
404|428
717|401
162|198
428|518
414|250.82
276|425
577|511
403|250.6
276|250.4
511|491
V15|278
996|V14
V45|403
585|285
281|414
721|722
715|250
431|518
424|427
427|496
162|250
395|414
300|250
343|317
250.83|996
342|784
428|707
255|682
507|425
585|414
443|250.6
428|E849
578|276
410|277
250|V43
403|511
V58|278
401|428
289|793
250.02|599
303|250
682|585
425|429
250.02|786
625|218
250.02|V58
560|386
197|162
427|414
599|518
428|357
411|412
591|401
799|560
411|511
403|428
682|710
E885|250.6
250.02|578
682|41
491|425
575|574
276|780
584|424
782|250
496|278
574|250
272|362
8|250
426|250
250.6|496
599|8
434|250.8
424|785
780|340
401|733
496|309
491|599
799|403
411|496
585|280
250|244
425|599
41|250.02
780|V15
573|401
198|585
584|E942
V43|401
626|617
496|401
790|401
405|785
432|585
284|276
493|428
799|278
998|414
511|287
996|428
250|294
300|E950
491|416
305|496
296|599
753|412
425|682
710|41
189|199
518|507
781|401
486|428
412|401
402|428
786|305
989|278
440|707
285|401
V42|250
585|458
250.82|250.6
285|414
788|?
250|278
511|530
162|401
411|285
428|733
997|560
998|427
511|780
682|780
840|250
599|414
745|401
277|250.02
813|E816
250.02|733
438|438
V70|V45
250.6|250.52
585|440
590|401
396|397
403|578
415|486
156|197
535|530
289|250
255|255
250.01|654
518|414
250|V17
790|412
722|V72
496|571
293|593
250.6|272
285|198
590|41
599|496
427|V45
V13|250
415|250
424|273
799|496
276|V58
600|V15
492|250
780|428
537|250.13
414|555
427|434
496|599
413|787
314|278
250|285
496|197
444|V15
681|401
599|427
707|402
250.13|250.6
403|447
276|V15
250.01|287
250.01|730
682|611
414|458
486|425
V58|401
611|610
V62|303
402|533
491|465
426|414
289|496
276|V85
530|427
562|569
V85|250
312|250
344|318
784|250
135|517
724|250
153|401
428|412
276|263
342|428
707|401
618|618
414|412
599|585
340|250.6
486|401
458|558
428|276
211|250
493|250.92
413|272
997|427
201|401
428|787
403|250
250|493
V42|250.53
250.42|404
250.41|403
38|995
345|277
491|427
427|722
276|496
682|459
285|492
531|280
496|403
496|425
428|576
789|38
574|401
507|496
280|250
560|428
112|591
327|272
428|278
599|41
788|250.6
414|426
250.02|824
535|357
518|424
724|V64
404|585
428|414
411|557
995|599
411|272
785|276
478|518
303|276
250|647
V15|401
305|401
424|402
440|V45
424|496
411|410
517|571
42|403
250.81|530
998|997
496|276
250.82|401
996|38
402|250
493|250.01
535|250
584|510
456|285
722|250.8
682|250.41
411|518
564|E947
682|295
305|295
427|294
428|338
786|V45
577|41
425|424
414|404
380|401
588|585
581|403
V45|V45
438|453
250.02|276
403|250.4
404|599
250.01|560
280|303
557|428
41|584
285|287
276|997
491|496
707|428
493|397
413|581
491|414
250|V15
413|401
250|518
150|413
275|414
567|404
599|270
682|682
198|276
780|288
428|511
518|E938
276|250.01
295|296
427|996
648|649
785|584
599|346
250.82|518
402|272
427|404
571|303
707|403
303|287
427|300
278|416
427|424
753|250
410|276
276|490
263|518
738|722
733|250
815|?
440|V42
355|924
714|250
280|276
286|788
585|276
512|250
401|280
998|285
276|E942
276|593
571|250.8
427|788
995|38
8|424
344|414
425|250
V45|285
707|276
295|707
250|V85
496|518
401|600
710|428
411|780
295|401
753|728
518|403
780|715
451|V42
218|618
250|682
285|211
799|305
585|E878
250.7|707
174|198
276|571
428|799
682|428
403|263
V57|250
250.02|244
E932|401
403|162
276|250.22
780|250.01
348|599
493|414
569|569
593|401
276|E885
707|41
511|423
733|414
995|584
41|682
288|287
799|441
285|V54
250.01|342
799|424
276|V49
491|70
584|250.53
493|786
453|403
591|276
411|402
642|648
427|558
428|599
496|458
V58|305
348|250.6
428|V12
331|294
427|V58
403|V42
E884|290
401|493
733|733
292|E885
584|203
198|496
427|710
403|496
305|574
496|515
287|41
496|789
591|250
276|493
276|799
250.01|V58
V10|250
567|790
414|250.02
299|250.1
496|250.02
342|401
781|276
599|424
38|518
403|41
426|412
426|427
255|287
444|414
284|572
427|784
250.6|536
466|250.5
733|250.01
250.22|425
424|424
707|438
151|197
E849|584
250.6|250.51
707|250.01
204|403
250.02|403
198|250
285|535
442|V45
585|588
E944|250
599|250.02
284|707
312|250.02
560|414
518|785
276|8
444|427
244|250
198|599
486|707
475|401
250.11|590
427|789
403|785
250|41
197|496
780|250.6
496|V45
599|250.6
413|V10
276|9
425|202
428|275
305|V58
722|250
250.01|E878
486|438
466|250
250.01|425
154|198
427|250.01
412|794
414|427
342|414
440|403
511|493
780|386
427|250.4
788|599
496|787
250|716
410|427
112|276
458|250
536|357
396|402
592|401
788|569
276|198
786|493
722|585
707|250.7
599|E888
162|496
496|305
250|459
518|8
V43|716
333|401
293|784
411|998
491|799
780|250
425|999
860|865
682|786
424|276
403|295
707|414
530|332
786|289
799|287
412|250
511|682
?|427
250.01|724
V65|V85
250.01|496
428|250.6
788|366
491|424
731|250.6
423|998
530|786
518|428
198|185
403|429
272|414
310|250
411|305
733|285
250.01|997
287|287
574|789
280|531
250.01|E812
518|427
302|780
276|414
250|276
584|581
425|790
571|518
530|403
287|493
590|995
202|414
530|530
348|511
197|250.01
428|411
403|250.42
866|861
780|438
924|E884
569|564
427|786
396|414
311|278
788|438
577|250.02
250.6|276
595|715
?|530
599|592
401|250.6
496|?
331|250.6
444|285
41|493
682|250.6
278|250.12
790|707
584|728
521|V72
825|824
309|250
571|286
287|426
428|395
555|250
346|250
250.92|428
V42|V42
404|250.4
428|998
719|414
196|250
162|511
285|428
794|401
595|788
413|403
584|486
564|E935
780|41
812|811
414|413
733|784
996|599
278|907
791|682
434|518
730|711
599|280
294|250
276|250.92
584|491
578|493
845|E885
997|511
250.8|276
486|496
574|197
428|715
428|580
780|162
389|250
V42|403
496|244
250.8|794
599|V43
786|414
414|496
396|584
571|427
427|416
425|250.92
250.01|276
414|250.5
996|730
575|250.8
340|162
263|466
239|276
577|438
278|493
198|250.82
413|412
585|569
648|250
584|518
276|682
493|998
427|327
220|401
428|493
250.01|402
425|153
443|250
571|496
560|459
394|401
707|250
410|285
787|244
428|593
250.6|250.7
530|553
272|?
E928|E849
197|250
250.92|V10
424|997
786|786
305|276
250.7|785
511|250
V42|250.51
799|185
410|496
E880|E849
189|401
786|704
599|578
41|604
411|707
491|433
250.1|414
562|250
403|V46
V15|250
250.03|305
189|530
250.02|412
276|318
733|553
780|403
E878|E849
250|496
276|627
250|365
41|707
599|599
599|574
707|250.03
507|428
276|41
511|285
280|414
789|568
599|272
750|553
403|414
998|682
998|250.6
285|276
562|211
511|599
577|284
410|E878
401|427
511|163
250.02|414
584|404
726|719
564|250
250.6|428
70|250
250.01|660
496|733
493|112
574|276
707|496
403|599
746|424
574|403
535|403
491|707
110|276
481|202
276|272
424|493
V42|580
496|564
794|250
427|595
560|272
250|V03
276|203
717|719
486|560
305|577
576|157
285|E888
202|428
272|V10
799|427
486|427
578|456
403|250.7
403|486
496|416
285|491
250.8|V58
788|591
287|276
250.03|999
250.02|305
250.02|466
250.8|401
584|427
486|593
585|442
V15|?
427|278
331|780
337|403
403|424
410|995
799|276
280|290
625|250
585|584
805|403
428|250.51
427|303
250.43|276
V11|V11
493|787
233|401
348|V66
411|493
250.92|496
V43|719
369|781
413|414
722|427
997|280
571|456
V43|V58
507|401
571|401
531|401
424|998
784|490
305|428
242|413
496|V49
342|715
714|311
297|298
491|41
718|715
816|E812
305|250.01
276|998
276|287
567|599
507|518
250.01|493
304|278
250.81|?
424|412
486|276
250|274
458|285
250|E888
585|578
284|280
584|305
414|250.8
415|599
997|276
486|414
427|250.8
278|403
250.2|431
664|250
707|250.8
536|337
397|424
253|278
428|491
799|414
305|807
410|428
403|282
414|433
414|402
807|E881
261|518
340|599
172|250
276|E879
348|342
250.02|?
535|535
305|V08
614|218
401|V62
411|415
427|348
411|786
413|396
E885|250
427|511
794|496
840|432
577|304
250|342
599|428
455|401
584|507
401|465
585|514
433|427
585|250.8
295|292
295|276
511|403
E878|410
482|416
250|327
823|438
493|599
250.32|276
595|518
427|457
383|388
736|401
913|?
574|571
V62|305
250|787
E878|427
401|530
425|496
250.01|E933
276|V14
481|496
340|250
584|997
427|426
V54|V43
E878|V10
709|250
319|401
997|518
162|196
250.81|571
518|491
707|440
285|496
276|783
413|584
270|414
729|459
860|585
435|250.6
780|295
599|V54
397|398
426|425
599|491
294|332
196|599
707|584
276|515
38|585
275|311
280|428
E888|E849
531|285
413|427
396|427
280|411
995|490
250.12|V58
E880|414
593|331
812|578
276|924
995|780
428|415
411|403
567|446
646|70
V63|707
250.01|272
728|785
250.02|535
424|397
511|428
599|596
138|250
292|780
304|493
411|997
340|401
428|585
331|924
427|593
250.81|286
496|285
250.01|908
403|595
250.1|244
198|427
250|V10
276|296
584|250.41
250.01|564
634|244
358|710
491|307
535|715
427|250.02
250.02|V45
578|202
491|585
276|292
576|197
428|41
250|794
197|560
403|787
496|530
401|785
V42|203
333|250
250.1|493
250.82|276
424|275
453|250
599|780
428|443
346|250.01
403|707
414|287
284|198
590|112
794|288
250|726
250.5|362
250.83|250.6
786|486
250.51|250.6
41|465
516|413
437|715
785|8
250|443
428|211
261|401
440|443
427|437
276|250.8
291|493
E888|414
401|433
799|250
V85|401
424|573
276|70
493|305
410|425
585|427
707|V85
402|250.01
135|250
401|300
515|783
250.01|427
287|571
428|492
276|781
201|496
592|788
599|263
250.41|593
253|285
789|569
584|250
560|496
682|785
799|401
590|790
401|250.5
296|530
205|403
250|188
250.93|789
305|414
486|458
584|425
492|276
491|530
599|530
250.8|681
424|272
157|401
568|427
599|368
250|366
250.01|790
789|163
E849|401
892|E920
199|250
996|250
718|305
493|250.8
V54|V45
652|648
295|788
427|731
280|401
E932|250.4
280|397
481|427
786|782
304|V15
780|997
280|427
441|276
847|842
413|428
465|403
250|593
682|916
428|287
682|493
287|780
599|584
571|486
276|600
780|429
403|996
250.92|285
196|410
451|496
710|250.02
429|427
276|786
572|789
8|996
269|614
728|250
413|997
518|E878
303|571
516|428
922|923
205|486
250|790
416|780
295|794
286|276
707|780
578|204
511|518
401|840
434|780
250|780
599|457
564|V12
458|414
493|401
493|V58
197|789
789|428
276|536
584|789
599|250.4
426|416
693|276
V85|425
276|250.82
250|477
425|493
788|285
293|780
424|599
280|571
401|276
915|681
276|996
327|250
411|250.4
202|250.01
513|730
584|401
707|424
197|493
303|311
204|401
599|E930
250|465
584|319
428|272
250.02|410
70|70
V43|285
435|250
707|486
189|197
427|458
272|305
290|332
V45|V43
707|357
428|562
427|402
382|380
577|414
280|593
276|535
426|250.01
E888|424
V42|276
272|465
250|293
304|276
157|518
411|577
552|401
569|560
414|423
401|278
440|427
331|V58
413|244
574|530
496|591
250.02|287
785|997
V02|V45
428|197
780|V49
707|274
162|512
357|250
V85|560
571|576
780|518
428|729
585|250.41
599|199
728|276
574|E933
440|414
482|518
402|412
V62|250
411|250.6
493|427
434|424
427|V14
723|250
414|285
378|250
577|263
263|599
V45|V12
428|251
444|496
413|250.52
250.5|447
428|584
428|560
204|356
626|401
491|682
518|348
560|396
571|276
204|428
272|250.5
864|250.01
584|682
568|401
250.01|490
564|698
730|999
530|250.01
250.02|272
41|250.7
286|V12
618|625
731|250.7
599|294
276|728
535|786
250.01|204
397|560
577|578
780|459
714|V58
831|275
403|272
285|730
496|730
451|250
577|560
518|515
786|197
428|434
585|425
492|303
342|433
403|V15
263|250
998|V43
V42|707
486|291
682|304
204|250.6
250.81|707
680|680
70|E931
425|486
401|728
733|722
250.01|305
427|746
250.03|405
427|E932
276|995
401|333
276|250.6
533|535
250.41|250.6
295|807
E935|250.02
592|617
425|V45
296|290
584|458
250.02|E884
574|577
277|401
411|250.01
707|681
586|782
414|338
584|496
599|331
813|250
428|578
511|425
569|428
250.01|682
585|244
799|428
574|428
250.02|300
276|456
412|428
303|298
414|786
627|250
276|112
250.82|496
780|552
?|703
196|518
250.02|626
403|584
280|599
491|402
518|560
V45|413
276|410
493|530
496|311
530|285
250.4|285
276|724
730|682
296|304
425|780
530|787
427|530
280|8
410|785
618|250
250.12|V65
560|998
411|585
491|272
286|401
305|794
577|535
625|614
584|287
112|131
250.53|250.6
427|785
599|396
786|427
781|357
585|250.01
575|250
276|486
578|458
280|585
995|995
250.81|276
486|277
250.01|653
618|617
617|626
204|427
435|414
283|401
V42|250.4
466|197
924|305
571|284
208|285
562|285
203|593
518|789
785|250
594|596
995|414
805|802
428|535
437|401
578|427
401|V15
348|295
280|787
496|94
428|780
250.02|251
524|525
411|287
250.01|295
250|300
428|785
197|401
342|368
286|285
493|518
518|V42
250.01|278
342|V85
648|659
433|440
491|515
873|427
70|280
496|441
923|E885
507|560
707|404
493|V46
787|389
303|300
174|434
578|280
607|?
250.4|585
189|428
785|425
276|E849
425|278
250.82|250.42
790|404
465|780
780|296
741|599
411|250.02
E942|780
427|386
411|584
780|458
996|401
250|733
574|427
414|244
414|428
250.52|427
285|281
642|250.4
250.6|414
301|786
427|196
786|511
496|287
578|569
250|70
295|174
250|357
440|401
276|42
427|435
250.01|530
435|784
276|V65
250.01|V27
453|250.02
250.02|493
276|331
518|493
428|782
38|263
250.01|311
486|424
285|V85
V58|276
E885|414
250.13|276
403|304
599|112
401|296
493|V09
518|250.02
403|413
250.02|967
276|404
512|458
287|303
250|V45
V64|250
780|758
285|250.02
V58|412
294|401
38|567
682|256
250.83|707
V45|250.4
288|250.02
780|250.5
599|250.92
427|185
710|425
461|401
255|253
244|272
250.02|424
250.12|305
428|280
707|459
496|250.51
355|250
515|416
593|493
250|240
250.03|414
250|616
780|V12
410|434
788|276
786|996
585|788
250.02|8
V45|707
427|535
496|511
789|493
276|250.12
599|V62
682|250.8
466|401
162|780
786|424
428|404
578|486
198|198
250.02|396
852|285
414|443
425|412
8|428
250.01|285
425|402
112|79
331|250.52
291|303
426|486
337|250.6
250|256
412|414
250.1|276
8|792
435|427
285|758
665|642
599|401
571|962
599|997
250.82|427
511|424
496|438
787|553
263|428
293|275
284|112
789|8
585|V42
426|458
403|581
518|401
478|250
492|V45
584|38
276|574
250.22|599
585|396
275|272
780|584
250.03|V45
238|284
V45|787
511|486
250.6|530
566|780
250|564
427|413
250.82|414
584|785
789|571
276|585
250.01|280
562|427
414|599
823|250.02
250.01|?
794|412
591|593
410|790
250.02|530
496|440
349|250.02
38|244
780|272
424|491
250|663
424|250.01
920|250
710|511
250.02|722
280|518
453|496
780|244
486|518
599|174
280|707
348|518
413|250.01
250.02|218
250.83|V42
785|443
V63|372
425|491
401|443
250.01|486
250|722
288|403
786|571
427|515
515|518
342|733
491|426
799|599
997|496
577|452
560|562
571|250.02
411|250.8
710|401
847|924
70|571
403|786
250.52|250.42
V15|305
428|530
584|V42
331|726
70|303
722|V45
511|411
424|135
707|731
496|531
492|812
492|710
788|250.82
305|518
790|403
578|250
850|276
491|441
242|E942
362|429
511|V09
996|585
557|518
338|401
411|425
465|250
560|599
404|188
285|E879
411|331
250.01|V45
780|V45
250.03|V15
E942|250
V10|V15
490|?
196|197
250.8|303
728|426
707|42
284|154
136|112
465|250.8
780|496
410|996
276|595
507|438
571|291
280|562
578|556
285|788
E888|396
428|250.8
427|272
38|731
291|401
E939|244
410|794
722|403
719|401
607|250
573|250
250|427
707|707
276|527
285|812
728|41
626|625
V42|402
482|38
274|250
710|558
402|580
465|285
566|305
710|294
401|327
710|530
560|567
285|459
530|715
584|707
496|585
493|411
354|250
789|272
585|581
584|585
285|456
788|V12
287|250
250.03|648
414|250.6
491|840
482|427
560|278
558|285
?|250
250.02|781
344|724
427|506
250.02|715
300|276
250.02|522
428|204
428|250.82
581|585
958|250.01
599|342
250.92|490
490|401
276|558
396|496
627|401
578|707
296|301
577|428
435|276
42|276
410|453
996|682
427|295
426|428
789|276
427|E942
411|V12
786|272
562|792
198|41
496|227
786|276
493|250.6
250.02|782
287|599
558|250
433|238
403|518
518|518
276|570
276|261
426|411
453|V46
V49|515
38|996
427|592
577|305
413|304
558|327
599|873
486|492
493|682
287|595
278|564
V17|786
560|276
112|?
203|250
719|E888
486|465
276|567
785|995
250.13|575
287|465
276|413
428|295
428|305
250.02|574
427|250.6
847|847
792|780
783|787
788|598
70|578
991|276
276|710
401|781
287|427
402|496
592|496
599|E880
V45|V65
428|279
496|289
574|280
332|250.6
511|799
250|V13
250|280
590|285
722|429
714|401
486|510
569|599
V58|E932
780|E878
427|433
682|403
584|300
250|786
571|585
646|648
278|V85
42|486
998|250.02
296|785
617|250
204|250
784|427
280|211
197|592
403|425
686|401
682|276
968|E855
345|493
566|250
496|715
427|V12
285|340
585|518
250|V61
648|664
682|599
414|562
287|458
518|482
250.82|287
304|305
599|386
428|V54
729|840
401|441
788|756
410|424
285|530
584|722
311|593
314|?
294|244
410|486
794|794
250.01|716
496|365
535|723
816|883
578|287
573|276
38|491
453|427
578|310
682|518
569|401
198|197
707|398
738|250
198|486
530|401
402|429
787|624
465|V08
424|511
300|780
424|585
V85|535
428|112
153|790
560|427
196|780
427|V42
465|276
276|34
425|276
593|785
337|443
V02|V09
493|272
427|331
416|250
599|995
530|?
197|997
411|433
682|287
789|530
593|414
585|349
V42|441
284|70
486|305
263|151
250.13|112
458|305
573|410
401|340
599|593
250|785
785|682
432|V45
427|518
276|578
496|710
648|250.01
648|997
724|338
427|V10
540|555
997|590
276|286
710|244
214|250
V43|250.6
590|591
584|411
413|250.41
560|486
E932|402
428|284
608|250
250.01|491
397|394
575|553
V09|401
906|250.6
276|327
453|272
491|300
276|433
723|401
202|250
473|250
342|250.6
53|204
428|V45
337|250
496|303
486|997
485|402
263|401
707|996
365|401
590|585
784|388
530|780
250|397
444|250
567|491
E887|250
599|682
434|342
459|182
53|403
427|403
415|V85
V45|585
205|250.02
250.13|250.43
789|787
496|E932
E880|250
998|788
790|250.02
295|411
70|250.01
250|429
553|531
487|493
529|470
401|250.02
272|288
424|695
433|496
599|288
162|285
377|707
202|272
428|266
682|996
198|401
427|286
41|553
571|789
780|707
599|493
602|596
183|276
196|427
682|162
309|301
303|577
197|414
285|781
790|276
272|E819
486|403
358|496
805|427
560|593
250.02|V66
581|786
530|535
785|786
663|V27
293|596
198|511
511|331
514|401
401|350
250.02|E932
403|583
599|E939
511|496
518|707
590|276
584|250.01
567|250.41
681|V58
527|414
403|789
438|729
250.6|780
427|790
427|453
250|989
530|250.6
403|305
536|250.02
496|722
780|493
402|997
112|496
996|300
927|250
599|300
272|300
382|351
193|245
V42|288
250.01|644
998|276
571|425
402|427
295|70
802|871
401|716
780|453
V45|244
998|41
424|578
410|599
599|486
511|162
428|250.92
782|401
250.4|250.6
486|303
531|250.6
426|424
8|585
278|542
730|250.6
427|70
789|786
867|427
807|427
799|250.6
401|426
276|705
491|486
572|276
42|112
682|496
584|414
599|729
433|729
780|305
404|250.01
197|576
558|562
276|473
458|272
276|909
157|403
403|723
373|305
428|437
294|276
276|311
959|E885
566|578
250.02|70
427|787
599|?
276|162
486|799
780|492
496|437
340|285
427|512
427|492
599|786
535|41
881|807
428|157
491|250.01
263|285
507|585
493|490
346|424
94|414
424|518
300|443
585|707
428|722
410|493
331|414
707|435
518|331
286|296
250.82|731
427|584
403|453
E885|E849
518|625
453|E878
816|824
425|V42
272|272
250.12|276
276|303
823|276
410|491
813|401
599|410
535|536
280|780
434|515
135|414
287|V63
486|515
250|791
711|998
511|250.8
250.51|596
728|486
413|E884
453|707
410|682
492|707
280|250.02
820|599
410|707
552|496
785|428
413|V45
753|788
250.4|403
250.02|303
E942|285
427|486
571|244
250.01|441
441|584
599|135
599|562
780|342
578|428
340|493
295|250.02
440|730
415|427
707|250.02
428|682
511|250.02
153|250
558|276
287|278
V63|401
728|780
250.43|403
38|599
560|401
786|721
581|244
753|401
250.8|707
574|584
788|562
276|577
424|411
425|584
786|530
263|327
196|174
816|E888
242|722
501|428
493|686
785|785
493|79
E849|285
244|401
250.93|?
198|287
401|424
511|490
595|401
996|70
584|250.4
599|299
250|473
592|591
413|440
585|682
296|303
486|296
286|496
428|250.03
707|272
850|998
585|416
599|571
288|783
293|496
780|250.02
706|250
250.92|682
415|453
250.92|403
680|276
998|496
572|571
428|465
305|780
338|414
996|786
250.01|707
70|428
V60|287
486|250.6
569|710
599|784
491|453
288|197
578|560
280|496
560|311
276|438
707|493
403|250.41
785|401
511|707
577|997
250|290
198|250.51
428|426
717|414
805|923
574|493
423|272
584|8
792|401
396|578
591|599
441|441
250.01|404
305|493
413|424
403|250.03
250|558
562|455
285|584
571|V49
189|250
996|444
707|571
250.03|535
401|440
571|574
722|425
426|401
250.02|571
730|250.82
447|414
578|285
250.92|401
722|518
521|401
585|295
8|250.6
780|250.51
250.82|782
153|414
398|599
V45|V15
584|560
250.01|780
425|239
491|995
496|435
574|716
996|552
780|150
799|244
250.02|311
276|491
575|573
250|714
733|599
112|250
250.42|276
682|250.51
583|250.5
440|285
591|996
944|682
413|410
401|V45
593|296
403|289
682|35
427|342
290|437
295|428
260|428
496|348
250.02|705
440|496
301|722
305|571
411|562
156|707
573|V85
211|211
150|197
496|295
211|V72
575|568
799|183
285|823
507|492
304|486
403|300
585|250.02
516|515
285|532
280|535
305|412
428|162
153|197
786|780
162|491
305|427
997|250.02
577|575
153|196
410|V15
V58|427
711|280
733|413
250|433
786|784
276|435
244|?
112|250.13
493|461
250.01|722
600|599
458|276
496|402
425|38
357|244
428|294
786|794
707|263
616|286
585|585
287|70
311|458
250.4|571
250.6|401
331|250
425|518
721|250
250.03|784
V62|401
553|414
786|396
E885|424
599|438
584|189
560|536
333|307
532|427
782|412
496|250.5
70|305
42|38
433|722
788|600
443|491
V45|729
V63|496
724|285
179|250
285|250.12
620|620
723|337
E932|786
41|250.03
305|244
516|185
348|995
788|730
567|287
427|780
607|250.02
250.6|282
262|574
284|250
518|276
909|599
41|535
410|518
304|250
682|934
276|E924
304|401
250.51|428
250.11|276
577|272
808|276
453|428
276|79
487|401
425|396
155|275
250.81|403
V49|707
272|244
434|432
780|357
401|112
396|493
401|780
403|958
197|196
535|401
584|536
41|714
196|493
995|276
721|721
518|728
780|719
428|202
682|V58
154|197
599|278
426|496
707|569
558|211
536|558
518|998
244|250.6
564|401
378|V45
8|276
280|458
250.12|278
250.03|401
486|517
537|577
411|578
560|202
331|401
263|E939
560|250.01
424|79
496|250.41
434|782
920|E812
728|348
865|V85
535|340
305|695
252|227
348|576
276|792
710|493
599|789
250.03|646
428|482
599|536
492|783
201|296
785|278
162|300
569|567
518|496
599|507
292|305
496|716
453|E927
278|701
536|401
578|787
575|250.6
560|564
528|E931
285|733
410|250
402|V15
425|286
53|250
427|794
286|571
789|401
518|410
41|693
491|584
?|401
425|569
285|585
413|70
250.01|201
716|427
812|305
569|276
426|426
41|331
V63|438
592|250.01
491|V42
306|786
250.01|518
453|151
305|278
V43|E878
416|428
285|707
996|276
496|E849
250.02|427
436|250
E888|427
438|414
414|571
491|578
729|401
438|781
512|V15
682|958
250.02|728
276|492
682|424
788|263
250.02|382
276|788
496|533
348|250
584|V85
250|659
444|305
E950|300
428|250.7
560|491
574|273
294|296
295|571
433|414
424|780
416|493
599|721
443|272
250.02|496
E888|250.6
250.01|251
584|70
518|873
250.02|998
491|518
585|263
287|300
585|599
250.11|38
437|312
250.81|599
516|162
285|285
491|263
99|401
285|493
511|250.6
785|403
415|202
789|303
198|196
781|250
781|437
250.02|V10
518|511
309|305
403|285
496|275
295|414
198|162
250.03|428
575|401
486|416
305|250.02
536|250
746|427
996|707
276|340
311|272
413|250.6
789|576
496|V58
414|250.52
250.22|331
571|287
250.41|250.51
448|401
E884|E849
496|296
492|493
42|455
250.02|716
250.02|V43
535|428
524|584
560|560
429|250
278|781
491|V65
250.01|416
203|E932
799|486
250.42|250.6
162|216
242|599
496|453
785|440
290|285
492|518
535|V44
595|428
425|250.03
401|490
536|V58
491|493
440|425
574|228
787|E938
E934|428
486|285
814|285
250.02|411
496|584
812|E888
578|401
41|244
425|413
79|280
202|446
303|263
571|70
198|E932
172|403
788|250.01
696|250
250.7|518
998|584
276|275
V58|162
444|442
282|412
425|305
162|507
V62|276
402|244
997|250.53
996|560
41|348
288|401
425|V58
578|585
250.12|599
496|V57
310|296
578|250.01
486|410
295|162
276|5
112|250.41
162|787
203|401
278|112
38|707
250|788
41|599
V45|263
211|562
151|446
807|E888
250.13|427
276|586
707|443
202|V46
250|491
426|786
562|682
424|250.03
428|813
496|444
287|573
808|808
493|365
574|250.01
197|599
820|865
402|788
584|780
959|E906
433|401
250.6|403
250|E932
293|V43
799|250.8
412|V45
733|428
491|790
780|285
724|737
719|V43
496|415
427|799
730|250.8
272|294
303|401
571|E933
401|458
425|426
428|397
346|?
410|490
591|288
576|427
567|403
340|729
272|V15
493|710
276|722
414|280
591|403
427|8
428|286
578|153
250.01|881
285|250.52
592|295
250.4|583
592|414
211|401
278|599
440|424
477|250
282|250
486|70
711|427
575|250.02
682|204
440|276
276|135
414|733
250.6|250.41
V43|715
574|737
584|799
428|285
427|244
428|515
427|277
425|788
428|201
492|535
584|41
250.8|414
648|648
535|300
493|263
250.6|586
562|716
362|401
348|790
711|712
413|536
199|276
401|794
511|250.01
599|816
V09|41
8|250.02
996|250.7
585|401
785|305
496|786
396|E927
276|240
715|V43
285|E956
410|607
590|424
599|437
785|780
198|285
599|E849
599|560
276|244
784|414
250.02|473
54|V15
780|733
682|581
480|401
284|486
518|V45
394|287
491|998
287|V10
415|157
E849|250
414|410
250.03|581
780|786
428|250.1
584|368
574|250.6
204|345
286|453
285|E935
V15|412
724|727
336|344
707|344
410|202
280|626
799|135
440|250
425|250.01
530|305
312|318
574|292
403|440
153|428
465|414
V63|42
453|578
117|V42
813|427
719|905
V10|V45
998|574
155|401
486|466
722|426
300|530
453|599
425|287
250.92|V65
428|571
411|535
401|331
E878|285
250.01|V42
411|710
998|250.01
584|511
496|V12
493|442
427|288
401|274
434|427
250.92|278
466|427
280|962
303|780
263|404
593|427
285|E878
512|413
292|404
250.5|401
424|253
250.02|682
780|414
453|585
780|412
788|605
728|275
301|244
496|997
491|250.8
466|783
250.02|558
490|780
493|799
585|530
301|276
278|790
295|294
280|621
780|E854
275|788
403|459
682|296
733|788
451|447
453|288
152|197
327|401
250.01|E888
427|170
790|41
535|211
284|205
496|277
276|784
205|276
276|782
276|560
576|576
427|840
727|727
280|415
70|287
348|403
202|E888
250.8|433
250.7|443
866|401
403|571
518|782
780|726
707|E929
276|V10
V43|428
575|285
E870|401
784|E942
728|786
604|599
301|250
781|781
999|285
599|718
427|112
292|280
250.6|696
518|585
410|53
38|451
531|530
568|V64
458|433
300|301
490|414
991|553
531|492
462|477
311|401
250.01|784
403|533
972|E858
786|296
425|693
348|907
427|274
496|293
707|?
618|788
157|280
424|331
250.02|437
262|276
401|V43
401|715
496|996
789|535
250|600
196|250.02
425|397
305|V15
285|V58
250.03|782
789|250
569|733
996|112
790|428
250.42|583
780|785
285|752
250.11|646
202|293
286|V58
282|518
301|496
280|553
162|357
721|716
453|307
250|369
424|V45
E879|285
453|438
191|780
996|E878
599|426
324|285
568|788
860|518
250.02|593
250.82|799
518|416
425|558
250.41|413
250.4|V15
414|185
245|250
482|493
578|577
618|402
440|250.7
414|296
518|486
413|331
435|401
997|442
112|278
997|250
995|785
427|625
303|486
250|403
296|780
465|?
780|787
592|427
515|41
250.6|491
428|625
276|332
305|291
403|451
518|304
250|438
805|426
485|250
781|729
276|384
493|V12
873|E888
276|465
411|530
41|680
V42|272
403|252
276|344
411|599
518|250.8
382|490
785|414
253|401
536|722
577|496
295|290
250.03|599
707|250.41
286|518
250|437
577|250.01
599|413
E888|332
496|443
799|518
997|618
710|402
599|564
E936|289
41|564
204|518
196|185
V45|425
861|E819
682|591
401|250.4
558|575
560|410
276|785
535|V45
425|70
599|434
287|401
112|620
493|295
568|789
286|789
682|250.92
492|780
786|V46
707|596
482|250.02
586|250
276|304
682|E878
V62|297
E932|599
608|782
203|787
437|403
496|411
458|V08
569|244
788|428
447|411
79|V15
250.02|112
493|424
799|250.02
413|786
724|218
401|242
847|250
680|414
250.02|802
V58|780
250|583
569|280
347|414
566|995
V42|250.03
263|294
575|787
401|478
453|276
518|162
599|V10
840|250.82
492|786
154|V58
507|707
715|250.6
250.2|745
319|250
380|238
250.6|813
V42|250.6
E878|414
301|280
560|250.42
641|648
593|V42
491|411
344|599
590|263
518|577
V58|462
41|41
250|654
707|578
272|250.4
191|305
250.6|E933
599|E816
428|458
305|782
591|618
659|250
276|282
427|E888
255|707
492|599
788|403
153|427
E885|401
250|996
781|799
V10|V10
585|250.4
295|288
998|611
458|426
572|287
250.92|276
250.6|280
183|197
202|276
377|428
518|599
428|997
250.02|491
191|401
412|272
425|782
496|682
443|405
496|204
790|682
507|E878
276|255
V18|789
V42|112
276|342
707|250.6
309|401
414|250.01
592|599
410|584
440|272
250.1|278
584|250.02
799|491
491|285
428|402
196|162
427|429
434|745
535|285
578|584
728|438
289|593
403|396
280|403
276|199
250.53|424
250.6|596
401|496
202|585
340|596
474|780
250.02|397
276|411
415|696
496|799
596|998
728|250.02
V44|250
403|753
349|599
250|356
496|810
491|784
455|250
250.01|197
414|593
780|585
296|250.01
V42|785
305|492
560|E878
707|305
599|916
287|560
491|162
428|909
250.03|V65
V54|250
787|780
787|401
403|412
428|253
250.02|290
E927|401
569|578
731|681
785|496
682|357
162|112
427|V85
280|783
491|403
411|440
411|244
154|707
203|427
305|285
493|731
486|574
592|252
710|277
369|?
V63|276
262|599
189|263
276|250.41
728|401
278|530
298|294
413|723
787|575
300|300
518|196
585|198
428|V58
840|726
75|78
E817|305
496|E880
426|250.6
428|711
996|780
466|285
300|294
403|E885
112|491
284|41
429|512
822|428
202|453
790|185
255|571
E816|682
626|250
295|342
250.41|585
536|276
378|401
518|618
785|151
250.6|995
428|135
250.03|?
868|E885
492|401
722|787
411|278
E944|458
518|263
584|591
285|280
584|532
303|272
414|584
E878|440
490|428
789|596
274|272
428|459
38|414
263|496
486|780
112|437
304|357
197|V45
585|580
599|575
456|707
250.02|433
V63|785
707|V58
512|496
780|535
787|530
530|707
162|535
998|599
403|250.8
E879|250
696|695
536|535
574|250.02
305|402
556|255
486|590
496|512
110|403
301|729
E814|E849
707|924
411|996
919|250
154|V44
250.6|427
786|E944
191|578
284|287
V14|V14
295|569
648|642
459|285
413|211
414|424
780|725
511|785
250.6|250.83
242|311
590|250.11
820|780
881|891
394|496
117|305
250.6|713
245|401
162|153
424|311
V15|274
8|401
553|285
425|799
536|112
585|41
491|197
553|564
276|250.52
567|496
250.13|?
585|250.6
562|305
997|401
730|41
996|452
496|V15
70|296
403|433
496|995
577|274
682|410
250.6|922
427|560
397|789
V10|412
799|707
998|401
290|276
575|276
70|568
416|402
204|414
218|620
276|53
277|446
719|250.01
438|590
805|296
162|733
807|599
291|425
368|305
204|413
577|574
414|724
34|250
584|453
41|250.6
707|730
401|311
425|416
250.6|733
250.6|820
833|842
996|996
427|287
70|401
723|784
197|491
295|599
305|301
785|711
297|401
70|530
410|823
198|192
996|905
276|348
287|437
403|275
V08|401
260|416
250.02|707
997|807
V42|780
516|486
348|438
153|424
426|998
730|250.81
250.12|493
420|555
411|327
785|424
518|738
421|996
873|250
998|280
486|934
481|276
303|305
682|443
733|401
424|571
287|403
998|543
571|790
518|402
492|997
614|401
585|424
599|198
438|188
599|70
285|573
518|278
515|276
515|V46
780|402
197|151
413|593
250.43|V46
599|998
250.02|997
462|305
812|?
285|246
812|E881
780|781
788|511
608|959
564|564
591|592
342|781
785|577
999|451
250|721
518|294
681|681
275|401
728|599
250.02|304
576|250.4
250|296
295|285
276|530
200|780
592|711
287|578
552|250
420|411
604|276
573|568
567|569
435|?
276|349
427|443
594|788
426|753
250|440
491|250.6
250.01|782
427|V43
42|577
396|599
427|726
244|530
491|810
577|425
577|577
553|305
557|250
790|V43
722|592
305|786
780|413
682|730
438|491
530|531
250|355
414|112
428|494
155|197
198|V10
196|511
280|789
556|8
196|289
414|998
250.4|250.5
428|410
562|311
38|403
698|E942
797|307
790|496
486|995
250.91|V27
E878|202
250.92|585
453|535
403|250.01
285|455
436|781
511|401
714|780
591|585
V42|427
507|780
189|511
590|250.02
581|276
998|627
396|997
263|491
617|218
425|593
413|490
786|564
112|416
682|731
250.8|357
496|574
335|E932
996|334
556|196
787|599
198|250.03
208|278
70|276
V15|272
573|571
413|595
250.6|790
278|457
578|747
414|356
V45|414
493|?
162|786
591|995
790|427
280|569
728|707
873|873
560|452
403|682
E888|V10
250.9|649
782|715
780|E888
286|428
276|205
569|285
250.82|250.52
593|403
288|250
285|836
V64|250.01
155|E947
V12|244
?|196
277|414
496|625
348|428
591|564
784|V15
404|425
440|250.92
998|403
276|279
337|710
253|276
512|428
278|272
590|250
250.02|789
250.9|278
305|E880
425|280
494|202
427|E935
727|414
733|276
786|719
437|294
401|535
611|E935
780|E937
786|250.6
741|719
491|205
444|337
584|578
945|402
250.01|642
250.22|276
250.6|369
518|780
290|V66
250.01|648
785|599
250.52|401
250|704
531|562
997|431
788|594
202|599
394|V42
294|428
756|250
433|272
569|600
414|V12
344|250
786|211
V62|V15
780|433
401|787
507|253
584|380
250.03|655
276|733
117|198
998|425
707|585
403|250.02
533|250
293|402
511|788
7|7
427|466
250.01|301
437|V12
428|331
999|682
719|250
V46|401
428|?
805|805
514|414
38|486
729|745
277|250.03
465|250.6
648|250.51
558|?
410|8
38|250.01
411|486
496|358
578|530
276|396
507|189
332|250
285|562
518|V10
493|464
730|424
250.02|575
786|593
584|535
250.6|41
244|427
112|250.02
486|785
578|599
518|997
780|411
428|250.12
791|382
285|426
250|562
434|428
V58|250
515|250.02
403|286
259|?
567|571
402|410
584|275
413|496
515|396
250|724
250.02|572
560|569
357|250.51
707|515
250|531
799|V45
530|V15
786|518
V12|250
998|999
578|496
425|272
285|157
304|295
428|579
907|780
V62|278
402|728
327|786
410|41
730|785
728|511
293|280
276|446
227|250
591|788
250.02|425
428|514
272|530
286|305
285|578
V64|280
403|250.51
41|E929
593|250.6
157|197
438|250.6
276|789
591|414
456|305
607|607
581|599
293|781
112|585
278|250.8
285|238
295|455
282|401
287|250.9
427|998
250.6|729
599|440
E853|965
799|70
920|814
577|595
799|781
790|250
357|276
284|V55
515|599
788|788
443|782
255|V58
518|437
396|424
567|250
730|788
574|535
780|8
518|255
682|788
E929|426
250.01|455
438|401
599|305
403|70
455|536
427|V15
496|783
428|244
E936|250
287|995
516|414
577|162
288|196
596|584
441|593
401|332
415|276
319|521
348|V45
250.01|599
482|428
558|458
614|621
428|250.42
711|996
786|473
V85|428
285|197
250.4|311
924|E885
710|286
410|466
198|172
440|715
496|478
486|585
682|272
196|170
263|403
276|189
250.01|41
428|558
394|250.92
284|403
348|414
441|250
682|790
443|401
458|244
722|721
584|446
721|402
250.6|425
E935|250
304|304
266|250
?|V45
802|427
250.02|625
535|276
250.01|577
401|518
428|79
196|799
250.81|584
278|715
862|338
155|286
997|340
428|438
584|250.6
599|E942
507|276
94|285
728|E932
491|202
401|555
342|351
411|V15
729|429
577|576
997|263
53|401
592|648
348|584
250.6|642
715|414
427|730
V15|315
410|396
883|585
250.8|788
285|425
427|250.51
250.02|584
492|403
250.12|41
70|690
413|531
466|276
729|782
428|250.52
486|295
584|396
701|478
434|714
568|562
250|412
434|276
781|403
438|530
250.02|263
300|318
441|574
155|491
112|V09
443|305
287|425
781|250.02
584|272
790|518
202|401
473|470
276|440
591|278
599|292
202|447
250.02|608
250.01|998
682|396
280|788
V85|780
272|274
287|714
250.02|585
250.51|969
276|596
728|402
568|553
493|466
537|V16
519|799
790|785
585|443
425|696
38|250.02
562|428
196|285
780|V43
424|413
511|714
428|196
427|553
276|351
277|403
786|607
486|453
276|557
38|E878
218|250
721|401
727|250
562|401
V58|250.53
576|599
V72|401
414|250.4
492|305
309|V15
276|402
V63|780
995|434
997|258
611|786
276|153
648|747
V46|250
592|593
786|785
560|787
70|284
136|V43
250.43|250.6
305|250.92
410|250.02
250|332
250.82|461
401|V58
135|V43
719|721
E888|715
276|290
599|710
782|276
401|564
263|265
518|250.01
576|38
337|511
466|786
301|301
599|446
250.6|250.53
995|707
412|593
433|784
808|781
285|998
296|437
410|V42
493|492
805|250
511|807
780|278
621|618
434|401
496|558
250.02|426
599|162
290|250
285|V45
410|244
242|518
E888|496
E928|250
998|575
536|V45
425|211
250.7|440
276|564
311|309
486|112
786|V10
491|733
790|490
599|244
415|197
493|V85
8|496
70|V43
250.8|709
578|238
585|70
496|250.8
411|284
112|428
707|V12
780|466
780|998
584|250.7
438|599
300|564
250.01|610
250|426
536|250.6
997|788
305|790
358|305
486|250.4
560|285
70|707
997|E878
411|447
457|250
441|401
285|531
815|E888
599|238
808|E885
276|V42
599|250.8
382|250
620|614
293|309
272|574
482|785
411|708
305|681
456|456
714|493
250|784
E930|599
426|305
515|333
413|511
410|250.01
787|403
414|714
428|999
416|403
496|332
814|458
453|486
593|250.8
403|694
780|507
196|496
550|553
250|799
295|V54
780|V42
707|8
285|?
780|427
518|284
444|998
492|438
402|425
780|574
250.13|252
250.53|250.43
197|276
250.01|664
924|E888
466|518
295|787
421|427
E950|250.93
242|401
493|280
425|438
438|733
V42|511
403|153
780|294
E878|428
403|577
486|396
444|805
?|250.6
707|250.81
263|427
786|729
446|8
276|681
345|250
518|821
496|250.92
E942|786
V45|584
301|300
574|576
348|867
250.01|403
V85|414
150|427
453|453
285|112
535|553
584|V15
781|342
560|995
V45|278
424|288
276|150
707|250.82
593|276
250.92|996
585|786
E812|250
437|412
42|287
710|786
258|787
291|724
807|E849
276|453
304|275
621|250.92
197|V10
427|455
250.01|789
458|530
790|493
707|294
453|153
434|303
599|707
E935|401
620|493
285|272
284|555
537|285
335|787
250.93|70
250.02|616
438|250.01
295|496
611|276
250.6|707
788|710
486|577
466|487
153|E934
V43|E927
276|443
585|785
873|923
196|V10
300|272
401|305
424|426
403|?
596|41
576|250.82
250.02|592
491|396
780|425
348|202
252|241
569|707
512|250.42
250.8|440
790|530
999|41
788|553
620|616
?|250.02
647|648
162|287
785|250.6
518|478
427|E878
711|599
8|244
496|410
250.8|696
719|E880
574|568
378|493
681|250.7
293|599
642|250
425|492
250.01|298
263|154
242|426
276|E904
285|41
403|466
295|562
250.52|276
496|482
411|426
584|592
453|289
473|346
162|428
285|698
401|507
518|204
250.8|438
250.81|491
348|486
424|425
601|601
287|V70
261|427
413|491
285|250.01
197|562
41|915
997|999
250.6|412
54|250
873|332
599|295
781|V43
250.02|487
196|276
250.4|593
530|300
459|250
340|518
473|401
284|518
491|435
250|V27
411|280
250.42|428
496|473
250.01|646
250|578
289|460
577|112
413|250.02
304|741
425|250.6
251|780
998|E849
8|535
500|786
250.6|945
808|403
E816|250
344|518
250.6|458
515|492
295|306
396|785
998|413
280|440
456|70
723|V42
401|553
250.02|201
250|292
403|198
600|285
250|698
293|250.02
38|276
574|V64
496|721
440|585
789|?
426|362
250.01|787
996|E879
427|562
564|414
496|242
578|562
486|280
433|342
496|577
557|584
459|41
250.03|403
788|250.03
566|569
203|496
822|E880
850|780
575|575
780|907
V23|648
995|250
733|578
287|263
153|280
277|250
250|574
293|250
614|250
250|605
999|999
745|290
434|997
276|626
458|401
427|436
70|780
250|424
625|V43
305|250.6
466|553
198|790
424|304
403|411
428|8
786|280
790|786
585|286
276|V43
189|198
427|?
574|272
584|410
413|V15
496|342
682|250.01
555|427
250.12|410
41|401
41|276
403|426
427|461
285|311
250.82|V58
998|707
287|250.02
42|591
576|41
585|338
276|309
250.8|294
780|362
435|780
276|704
997|425
250.02|660
276|592
413|202
535|301
V85|278
E968|873
E942|414
403|998
427|440
281|250
411|443
599|250.03
201|198
250.11|?
724|401
627|V18
411|492
E878|715
600|250
585|710
276|38
648|250.02
272|428
250.92|41
599|785
272|276
250.02|443
428|311
250.11|403
428|242
562|493
493|507
424|730
807|923
250.5|250.6
276|426
701|278
250.03|518
340|298
238|250
250|696
305|311
293|303
311|530
584|590
250.01|617
710|276
411|V85
276|288
250.11|250.6
618|305
680|41
553|250
578|303
285|250.92
401|786
682|794
432|414
196|275
305|413
496|593
596|250
300|401
424|389
492|250.02
263|250.81
291|780
707|511
180|401
648|653
162|518
511|276
287|288
478|780
291|250
E887|300
250.82|112
31|305
787|786
531|E878
250.02|288
599|E879
790|250.51
998|433
794|723
414|274
625|272
403|420
112|577
426|276
599|726
112|482
?|493
276|823
280|70
322|951
305|585
785|275
599|466
E932|294
681|727
511|250.4
250|553
518|411
625|285
294|486
428|788
250.5|285
278|276
305|42
780|908
410|402
891|?
496|610
584|788
244|791
285|403
496|301
442|250
784|198
186|401
53|250.5
197|368
V45|790
197|428
681|272
424|781
451|289
428|648
202|496
414|447
250.92|478
808|428
250|351
998|622
707|728
314|300
567|518
516|250.01
285|789
285|412
250|719
414|787
357|332
599|728
250.03|V49
250|693
682|782
913|401
V42|536
585|511
411|250.03
492|162
788|295
496|188
401|455
157|599
250.01|786
250.6|786
331|272
218|616
427|576
536|998
794|272
331|41
996|427
733|724
428|296
997|453
303|496
727|285
250.01|792
486|287
415|492
E944|276
459|250.8
E888|401
305|453
569|250.02
276|274
808|414
491|487
496|V10
427|397
294|290
806|276
571|250.01
402|V10
250|783
E878|250
386|250
785|426
710|599
357|250.7
V49|427
648|V58
413|515
305|?
250.02|157
571|285
250.01|458
V12|412
428|933
424|250.6
413|135
284|427
518|V85
780|303
813|733
793|250
711|41
346|401
250.6|424
337|458
599|E936
401|250.83
808|585
453|278
616|250
599|787
296|239
577|785
250.03|681
692|253
710|736
784|781
428|250.5
824|250
425|553
250.11|250.41
V10|300
E935|E849
560|493
403|284
250.12|296
453|250.83
250.5|276
414|278
584|V45
780|722
620|220
342|424
980|E950
349|293
428|719
250.01|794
682|416
780|191
512|8
428|996
427|517
365|361
403|780
492|443
786|250.02
153|707
250.51|250.41
250|490
276|298
733|719
427|618
780|250.4
410|E885
396|410
250.13|285
564|V10
568|584
574|412
455|455
135|276
162|799
789|287
808|E888
E931|414
453|404
V85|599
924|922
780|486
E888|836
295|648
250.02|131
416|397
799|736
996|250.13
276|802
444|958
733|726
250.02|E942
427|E885
425|465
410|578
492|204
396|681
309|309
V65|250
305|296
413|250.53
198|507
511|V10
805|202
506|491
518|425
70|427
250.02|562
305|V10
296|250.6
493|425
397|396
578|414
135|250.01
V17|458
285|E818
410|411
295|V64
719|729
416|427
440|584
348|263
714|356
E885|491
583|403
788|664
276|202
486|150
998|440
413|402
293|242
404|278
112|342
788|V10
401|70
780|332
491|295
507|250
682|110
285|300
444|272
459|457
E885|272
999|250
250.02|785
785|272
428|348
518|495
255|276
281|909
780|263
266|396
599|515
440|581
492|784
600|788
599|458
403|94
53|276
723|719
402|731
493|252
411|292
368|414
682|305
276|94
438|428
530|280
250.03|282
478|416
154|284
850|845
285|278
214|368
E944|401
94|250
414|396
E939|401
250.02|648
348|E853
E879|403
490|250
621|627
998|780
486|162
411|724
403|250.43
38|38
466|416
730|427
728|V85
V57|V43
V63|584
560|38
486|433
493|564
V15|V12
585|405
276|242
965|787
V63|585
453|444
285|411
V85|244
724|599
998|618
397|414
42|585
591|188
432|250.02
280|E888
304|250.01
491|410
530|574
455|211
250.02|284
427|564
456|572
581|250.6
250.82|595
344|250.02
220|250
578|211
682|728
196|188
518|305
486|250.02
196|263
276|294
850|305
611|250
599|255
414|425
507|112
112|425
285|560
707|715
782|511
V43|263
560|996
288|585
285|E884
413|433
250.22|584
790|486
250.02|701
458|593
577|584
569|411
438|423
276|969
997|411
909|V10
250.01|556
282|V10
536|599
789|536
204|276
202|285
145|285
599|348
342|787
398|745
496|681
250.02|577
682|535
511|414
799|567
458|404
250.02|438
574|553
250.01|920
416|787
599|794
535|280
250.8|344
796|426
572|486
496|218
496|250.7
286|427
202|584
280|288
276|507
590|403
401|E849
396|401
424|807
V58|?
250|873
787|787
205|786
250.93|998
530|276
276|250.43
348|250.02
342|272
368|784
789|782
496|802
250|218
434|403
682|596
562|V12
242|681
813|?
E944|V10
250.8|584
599|V15
453|458
581|414
536|560
722|998
648|654
569|403
9|211
574|V85
805|260
152|196
E942|E942
344|453
V12|278
785|250.02
996|414
719|285
496|433
426|403
285|533
411|787
496|38
357|401
311|V58
E935|276
972|E950
584|574
511|197
524|473
427|868
553|535
250.02|518
428|446
496|E885
571|272
250.91|655
428|E880
836|250
556|V45
453|459
512|584
276|300
424|410
682|995
583|276
272|600
493|244
486|V12
682|112
812|518
511|789
E812|401
616|E878
227|401
5|250
205|250
780|250.7
481|428
585|453
250.5|V54
611|E849
427|211
V42|401
998|250.7
424|560
53|V07
427|997
518|272
8|493
250.01|332
496|308
518|799
E927|E849
309|303
599|616
799|295
786|402
424|278
V45|410
517|515
402|530
284|599
304|724
553|280
285|786
591|250.4
293|V45
135|304
788|250.02
786|496
V58|414
719|438
486|402
403|394
599|E932
276|246
959|250
553|401
493|722
710|517
287|250.4
250|596
250.02|465
278|V10
515|E885
287|411
277|482
493|338
413|558
305|530
276|V45
661|V27
425|728
250.01|694
788|601
427|410
481|518
493|340
340|276
459|443
453|922
492|728
427|41
493|486
722|414
198|174
V10|788
E932|285
38|785
34|244
282|365
805|305
284|286
812|726
250.02|790
578|564
153|199
250.52|285
723|355
969|780
747|424
138|250.6
424|250.02
411|458
601|788
864|860
250.51|411
466|250.6
491|466
303|250.8
197|585
440|682
402|411
401|727
424|416
784|342
427|317
495|453
496|279
263|276
581|511
410|E935
8|427
112|486
303|291
303|338
422|425
413|196
482|255
276|715
357|300
785|295
197|453
558|238
292|250.02
428|70
277|250.6
162|276
530|272
870|802
202|284
250.82|403
424|482
162|396
584|996
425|608
202|204
996|V58
196|414
998|282
486|788
453|250.01
722|724
441|414
250.01|424
572|70
250.83|285
V85|402
276|680
823|873
486|411
174|250
70|295
453|553
150|V44
425|238
276|382
250.02|641
250.02|753
573|V10
348|573
785|730
428|710
696|491
569|493
599|435
413|518
998|412
415|282
573|174
573|255
295|493
919|789
574|997
403|278
411|250.81
304|466
185|414
256|250
424|461
491|287
278|244
458|785
812|822
496|E822
410|786
577|518
396|398
162|338
790|571
424|728
272|729
515|584
250.02|787
401|290
493|590
528|401
396|250
599|781
250.6|438
356|401
682|722
292|496
250.42|581
250.02|738
E906|E849
486|275
599|332
427|783
287|197
998|E870
585|287
590|38
998|250.5
578|424
789|70
681|250
584|280
796|250
331|431
V43|V45
411|491
682|V43
401|396
593|272
788|414
198|250.6
250.4|581
276|323
204|250.01
278|428
291|276
427|150
568|272
345|276
198|412
496|756
276|250.23
185|285
531|?
414|785
584|250.82
787|414
789|403
401|533
162|172
199|401
788|493
733|272
787|112
496|E881
440|905
162|414
682|695
490|593
682|94
433|424
585|719
996|607
357|337
516|458
276|E888
438|250.02
428|435
599|296
583|780
492|414
280|E849
516|429
437|785
414|294
996|711
250.7|492
424|553
276|562
396|276
416|V58
294|300
518|718
349|250
496|447
496|8
275|276
577|568
748|276
250.02|295
403|443
433|425
162|427
424|568
728|719
250.41|758
601|285
555|E944
868|94
905|250.01
531|342
456|280
491|E885
424|E878
250.42|401
596|601
41|780
220|793
E878|787
303|428
496|569
535|455
V54|V54
728|403
415|416
285|787
719|V54
285|511
285|244
V58|V43
728|285
294|365
411|411
682|E879
493|707
?|428
493|358
425|203
290|682
276|250.5
411|250.82
276|708
444|440
493|337
335|401
492|V10
788|294
824|E881
276|362
823|821
250.01|411
413|305
724|535
873|920
250.01|477
823|250.6
427|781
560|530
198|491
8|?
428|250.81
255|414
203|473
486|250.9
250|298
923|E880
456|303
198|428
496|386
553|276
250|710
8|599
281|294
344|564
784|593
292|250.01
41|996
524|41
491|V54
153|?
911|916
V43|414
250.6|440
682|228
425|208
425|301
227|465
402|250.4
196|611
599|253
70|786
E849|E935
496|784
496|304
263|414
790|996
424|564
285|V10
280|V45
202|250.6
428|991
410|413
780|287
162|453
788|412
306|306
285|398
730|440
337|722
493|515
518|303
250|211
444|707
250|781
599|E944
789|427
782|272
V85|682
154|401
710|716
446|250
680|693
250.03|427
E918|250
491|511
150|278
820|E888
507|482
357|415
296|493
440|358
780|153
571|?
250.01|V12
276|289
681|945
E965|E849
996|453
599|E934
618|218
599|433
292|309
493|162
250.02|242
250.11|305
599|V42
507|197
250.01|426
E885|250.01
250.02|V15
162|997
712|715
250.1|342
