00
787
250.6
428
435
584
440
8
718
V57
998
491
715
250.8
338
820
276
512
786
560
157
682
410
789
784
571
196
414
482
535
599
575
434
296
996
444
824
574
611
211
781
507
153
426
486
202
530
493
250.81
707
518
736
552
250.12
558
250.13
191
250.42
183
654
481
218
182
411
38
250.11
197
433
808
416
592
250.1
278
250.82
425
427
250.02
250.7
577
188
726
404
516
285
780
415
671
402
79
303
162
185
601
531
250.4
458
70
527
576
810
721
401
431
424
250.03
730
432
722
112
562
823
807
747
733
578
386
557
785
47
579
995
490
822
515
799
V55
304
997
805
459
564
540
728
9
250.2
585
550
983
378
724
532
421
478
727
293
250.01
295
511
913
455
275
920
413
800
403
436
441
250.23
473
850
590
52
5
348
198
604
346
618
287
453
745
641
536
852
250.41
593
569
510
821
280
723
298
154
238
812
227
311
648
250.22
790
962
V54
600
614
987
524
487
969
331
V58
694
522
553
466
788
398
756
250.92
573
189
250
174
437
924
294
443
729
625
621
290
359
533
241
519
438
566
135
537
801
244
420
309
340
78
194
572
644
977
528
?
738
892
155
816
220
355
711
496
V53
288
42
782
250.83
250.31
430
349
959
289
272
825
793
274
180
866
681
565
242
255
844
620
292
646
581
483
345
958
714
795
225
851
935
442
669
456
370
632
215
968
237
860
246
212
351
457
380
709
V71
376
266
813
446
556
501
361
253
447
412
454
53
284
475
291
396
794
485
34
250.21
332
277
84
693
706
368
362
323
374
882
586
922
661
199
664
305
263
966
626
240
307
250.3
300
250.9
11
710
171
642
495
591
312
555
235
49
252
357
151
567
358
967
846
170
853
655
965
608
551
595
429
746
187
656
719
451
335
826
239
193
992
583
250.33
354
658
680
251
716
150
886
526
659
653
273
184
327
82
385
494
54
596
250.32
283
883
462
514
382
840
691
465
835
705
463
203
423
461
660
200
388
737
480
568
989
534
942
250.51
933
98
286
725
445
205
864
695
333
230
282
250.43
158
891
904
V26
972
783
814
603
607
971
297
163
717
117
970
605
233
383
48
341
881
27
179
152
832
759
377
513
893
V45
843
161
847
35
V56
685
964
146
990
208
870
521
692
369
831
643
796
94
3
66
645
921
281
861
114
802
175
999
V63
226
863
865
477
616
310
647
806
31
663
529
952
622
492
337
934
156
136
652
61
627
975
306
842
994
867
314
474
141
V66
464
204
873
E909
751
366
797
356
634
879
928
88
39
394
301
890
508
657
344
649
250.52
216
352
201
228
862
41
923
623
379
594
570
875
470
210
V60
885
143
245
250.5
223
405
945
792
696
986
598
588
350
837
916
602
541
395
V25
836
164
815
417
250.93
353
342
214
633
173
542
172
617
734
845
148
939
955
720
360
192
261
115
391
320
803
665
683
708
381
131
448
452
735
397
384
336
619
854
36
V51
147
833
957
703
791
868
839
229
610
991
324
903
753
963
347
236
422
686
914
375
142
580
110
936
250.53
7
871
704
149
804
690
308
219
732
250.91
637
