<?xml version="1.0"?>
<net name="gaze-estimation-adas-0002" version="6" batch="1">
	<layers>
		<layer name="right_eye_image" type="Input" precision="FP32" id="0">
			<output>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>60</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer name="Mul1_2037/Fused_Mul_/FusedScaleShift_" type="ScaleShift" precision="FP32" id="1">
			<data broadcast="0" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>60</dim>
					<dim>60</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>3</dim>
					<dim>60</dim>
					<dim>60</dim>
				</port>
			</output>
			<blobs>
				<biases offset="0" size="12" />
				<weights offset="12" size="12" />
			</blobs>
		</layer>
		<layer name="102" type="Convolution" precision="FP32" id="2">
			<data dilations="1,1" group="1" kernel="3,3" output="32" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>60</dim>
					<dim>60</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>60</dim>
					<dim>60</dim>
				</port>
			</output>
			<blobs>
				<biases offset="24" size="128" />
				<weights offset="152" size="3456" />
			</blobs>
		</layer>
		<layer name="103" type="ReLU" precision="FP32" id="3">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>60</dim>
					<dim>60</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>60</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer name="Mul1_1977/Fused_Mul_/FusedScaleShift_" type="ScaleShift" precision="FP32" id="4">
			<data broadcast="0" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>60</dim>
					<dim>60</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>60</dim>
					<dim>60</dim>
				</port>
			</output>
			<blobs>
				<biases offset="3608" size="128" />
				<weights offset="3736" size="128" />
			</blobs>
		</layer>
		<layer name="105" type="Convolution" precision="FP32" id="5">
			<data dilations="1,1" group="1" kernel="3,3" output="16" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="2,2" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>60</dim>
					<dim>60</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>30</dim>
					<dim>30</dim>
				</port>
			</output>
			<blobs>
				<biases offset="3864" size="64" />
				<weights offset="3928" size="18432" />
			</blobs>
		</layer>
		<layer name="106" type="Convolution" precision="FP32" id="6">
			<data dilations="1,1" group="1" kernel="3,3" output="64" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>30</dim>
					<dim>30</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>30</dim>
					<dim>30</dim>
				</port>
			</output>
			<blobs>
				<biases offset="22360" size="256" />
				<weights offset="22616" size="36864" />
			</blobs>
		</layer>
		<layer name="107" type="ReLU" precision="FP32" id="7">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>30</dim>
					<dim>30</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>30</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer name="Mul1_1941/Fused_Mul_/FusedScaleShift_" type="ScaleShift" precision="FP32" id="8">
			<data broadcast="0" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>30</dim>
					<dim>30</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>30</dim>
					<dim>30</dim>
				</port>
			</output>
			<blobs>
				<biases offset="59480" size="256" />
				<weights offset="59736" size="256" />
			</blobs>
		</layer>
		<layer name="109" type="Convolution" precision="FP32" id="9">
			<data dilations="1,1" group="1" kernel="3,3" output="32" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="2,2" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>30</dim>
					<dim>30</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>15</dim>
					<dim>15</dim>
				</port>
			</output>
			<blobs>
				<biases offset="59992" size="128" />
				<weights offset="60120" size="73728" />
			</blobs>
		</layer>
		<layer name="left_eye_image" type="Input" precision="FP32" id="10">
			<output>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>60</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer name="Mul1_1965/Fused_Mul_/FusedScaleShift_" type="ScaleShift" precision="FP32" id="11">
			<data broadcast="0" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>60</dim>
					<dim>60</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>3</dim>
					<dim>60</dim>
					<dim>60</dim>
				</port>
			</output>
			<blobs>
				<biases offset="133848" size="12" />
				<weights offset="133860" size="12" />
			</blobs>
		</layer>
		<layer name="93" type="Convolution" precision="FP32" id="12">
			<data dilations="1,1" group="1" kernel="3,3" output="32" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>60</dim>
					<dim>60</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>60</dim>
					<dim>60</dim>
				</port>
			</output>
			<blobs>
				<biases offset="133872" size="128" />
				<weights offset="134000" size="3456" />
			</blobs>
		</layer>
		<layer name="94" type="ReLU" precision="FP32" id="13">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>60</dim>
					<dim>60</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>60</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer name="Mul1_1953/Fused_Mul_/FusedScaleShift_" type="ScaleShift" precision="FP32" id="14">
			<data broadcast="0" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>60</dim>
					<dim>60</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>60</dim>
					<dim>60</dim>
				</port>
			</output>
			<blobs>
				<biases offset="137456" size="128" />
				<weights offset="137584" size="128" />
			</blobs>
		</layer>
		<layer name="96" type="Convolution" precision="FP32" id="15">
			<data dilations="1,1" group="1" kernel="3,3" output="16" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="2,2" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>60</dim>
					<dim>60</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>30</dim>
					<dim>30</dim>
				</port>
			</output>
			<blobs>
				<biases offset="137712" size="64" />
				<weights offset="137776" size="18432" />
			</blobs>
		</layer>
		<layer name="97" type="Convolution" precision="FP32" id="16">
			<data dilations="1,1" group="1" kernel="3,3" output="64" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>30</dim>
					<dim>30</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>30</dim>
					<dim>30</dim>
				</port>
			</output>
			<blobs>
				<biases offset="156208" size="256" />
				<weights offset="156464" size="36864" />
			</blobs>
		</layer>
		<layer name="98" type="ReLU" precision="FP32" id="17">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>30</dim>
					<dim>30</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>30</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer name="Mul1_2025/Fused_Mul_/FusedScaleShift_" type="ScaleShift" precision="FP32" id="18">
			<data broadcast="0" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>30</dim>
					<dim>30</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>30</dim>
					<dim>30</dim>
				</port>
			</output>
			<blobs>
				<biases offset="193328" size="256" />
				<weights offset="193584" size="256" />
			</blobs>
		</layer>
		<layer name="100" type="Convolution" precision="FP32" id="19">
			<data dilations="1,1" group="1" kernel="3,3" output="32" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="2,2" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>30</dim>
					<dim>30</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>15</dim>
					<dim>15</dim>
				</port>
			</output>
			<blobs>
				<biases offset="193840" size="128" />
				<weights offset="193968" size="73728" />
			</blobs>
		</layer>
		<layer name="110" type="Concat" precision="FP32" id="20">
			<data axis="1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>15</dim>
					<dim>15</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>15</dim>
					<dim>15</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>64</dim>
					<dim>15</dim>
					<dim>15</dim>
				</port>
			</output>
		</layer>
		<layer name="111" type="Convolution" precision="FP32" id="21">
			<data dilations="1,1" group="1" kernel="3,3" output="128" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>15</dim>
					<dim>15</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>15</dim>
					<dim>15</dim>
				</port>
			</output>
			<blobs>
				<biases offset="267696" size="512" />
				<weights offset="268208" size="294912" />
			</blobs>
		</layer>
		<layer name="112" type="ReLU" precision="FP32" id="22">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>15</dim>
					<dim>15</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>15</dim>
					<dim>15</dim>
				</port>
			</output>
		</layer>
		<layer name="Mul1_1989/Fused_Mul_/FusedScaleShift_" type="ScaleShift" precision="FP32" id="23">
			<data broadcast="0" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>15</dim>
					<dim>15</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>15</dim>
					<dim>15</dim>
				</port>
			</output>
			<blobs>
				<biases offset="563120" size="512" />
				<weights offset="563632" size="512" />
			</blobs>
		</layer>
		<layer name="114" type="Convolution" precision="FP32" id="24">
			<data dilations="1,1" group="1" kernel="3,3" output="64" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="2,2" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>15</dim>
					<dim>15</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</output>
			<blobs>
				<biases offset="564144" size="256" />
				<weights offset="564400" size="294912" />
			</blobs>
		</layer>
		<layer name="115" type="Convolution" precision="FP32" id="25">
			<data dilations="1,1" group="1" kernel="3,3" output="128" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</output>
			<blobs>
				<biases offset="859312" size="512" />
				<weights offset="859824" size="294912" />
			</blobs>
		</layer>
		<layer name="116" type="ReLU" precision="FP32" id="26">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer name="Mul1_/Fused_Mul_/FusedScaleShift_" type="ScaleShift" precision="FP32" id="27">
			<data broadcast="0" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</output>
			<blobs>
				<biases offset="1154736" size="512" />
				<weights offset="1155248" size="512" />
			</blobs>
		</layer>
		<layer name="118" type="Convolution" precision="FP32" id="28">
			<data dilations="1,1" group="1" kernel="3,3" output="64" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="2,2" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<biases offset="1155760" size="256" />
				<weights offset="1156016" size="294912" />
			</blobs>
		</layer>
		<layer name="119" type="Convolution" precision="FP32" id="29">
			<data dilations="1,1" group="1" kernel="3,3" output="256" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<biases offset="1450928" size="1024" />
				<weights offset="1451952" size="589824" />
			</blobs>
		</layer>
		<layer name="120" type="ReLU" precision="FP32" id="30">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer name="Mul1_2001/Fused_Mul_/FusedScaleShift_" type="ScaleShift" precision="FP32" id="31">
			<data broadcast="0" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<biases offset="2041776" size="1024" />
				<weights offset="2042800" size="1024" />
			</blobs>
		</layer>
		<layer name="122" type="Convolution" precision="FP32" id="32">
			<data dilations="1,1" group="1" kernel="3,3" output="512" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<biases offset="2043824" size="2048" />
				<weights offset="2045872" size="4718592" />
			</blobs>
		</layer>
		<layer name="head_pose_angles" type="Input" precision="FP32" id="33">
			<output>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer name="gaze_vector/Dims/Output_0/Data__const" type="Const" precision="I32" id="34">
			<output>
				<port id="0">
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="6764464" size="4" />
			</blobs>
		</layer>
		<layer name="150/Dims/Output_0/Data__const" type="Const" precision="I32" id="35">
			<output>
				<port id="0">
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="6764468" size="4" />
			</blobs>
		</layer>
		<layer name="141/Dims/Output_0/Data__const" type="Const" precision="I32" id="36">
			<output>
				<port id="0">
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="6764472" size="4" />
			</blobs>
		</layer>
		<layer name="140/Dims/Output_0/Data__const" type="Const" precision="I32" id="37">
			<output>
				<port id="0">
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="6764476" size="4" />
			</blobs>
		</layer>
		<layer name="137/Output_0/Data__const" type="Const" precision="I32" id="38">
			<output>
				<port id="0">
					<dim>2</dim>
				</port>
			</output>
			<blobs>
				<custom offset="6764480" size="8" />
			</blobs>
		</layer>
		<layer name="138" type="Reshape" precision="FP32" id="39">
			<data dim="" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer name="129/Output_0/Data__const" type="Const" precision="I32" id="40">
			<output>
				<port id="0">
					<dim>2</dim>
				</port>
			</output>
			<blobs>
				<custom offset="6764488" size="8" />
			</blobs>
		</layer>
		<layer name="130" type="Reshape" precision="FP32" id="41">
			<data dim="" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer name="139" type="Concat" precision="FP32" id="42">
			<data axis="1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>515</dim>
				</port>
			</output>
		</layer>
		<layer name="140165" type="Unsqueeze" precision="FP32" id="43">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>515</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>515</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer name="141161" type="Unsqueeze" precision="FP32" id="44">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>515</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>515</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer name="142" type="Convolution" precision="FP32" id="45">
			<data dilations="1,1" group="1" kernel="1,1" output="320" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>515</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>320</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<biases offset="6764496" size="1280" />
				<weights offset="6765776" size="659200" />
			</blobs>
		</layer>
		<layer name="144" type="ReLU" precision="FP32" id="46">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>320</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>320</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer name="145" type="Convolution" precision="FP32" id="47">
			<data dilations="1,1" group="1" kernel="1,1" output="80" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>320</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>80</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<biases offset="7424976" size="320" />
				<weights offset="7425296" size="102400" />
			</blobs>
		</layer>
		<layer name="146" type="ReLU" precision="FP32" id="48">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>80</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>80</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer name="Mul1_2049/Fused_Mul_/FusedScaleShift_" type="ScaleShift" precision="FP32" id="49">
			<data broadcast="0" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>80</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>80</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<biases offset="7527696" size="320" />
				<weights offset="7528016" size="320" />
			</blobs>
		</layer>
		<layer name="148" type="Convolution" precision="FP32" id="50">
			<data dilations="1,1" group="1" kernel="1,1" output="3" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>80</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<biases offset="7528336" size="12" />
				<weights offset="7528348" size="960" />
			</blobs>
		</layer>
		<layer name="150" type="Squeeze" precision="FP32" id="51">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer name="gaze_vector" type="Squeeze" precision="FP32" id="52">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
	</layers>
	<edges>
		<edge from-layer="0" from-port="0" to-layer="1" to-port="0" />
		<edge from-layer="1" from-port="1" to-layer="2" to-port="0" />
		<edge from-layer="2" from-port="1" to-layer="3" to-port="0" />
		<edge from-layer="3" from-port="1" to-layer="4" to-port="0" />
		<edge from-layer="4" from-port="1" to-layer="5" to-port="0" />
		<edge from-layer="5" from-port="1" to-layer="6" to-port="0" />
		<edge from-layer="6" from-port="1" to-layer="7" to-port="0" />
		<edge from-layer="7" from-port="1" to-layer="8" to-port="0" />
		<edge from-layer="8" from-port="1" to-layer="9" to-port="0" />
		<edge from-layer="9" from-port="1" to-layer="20" to-port="1" />
		<edge from-layer="10" from-port="0" to-layer="11" to-port="0" />
		<edge from-layer="11" from-port="1" to-layer="12" to-port="0" />
		<edge from-layer="12" from-port="1" to-layer="13" to-port="0" />
		<edge from-layer="13" from-port="1" to-layer="14" to-port="0" />
		<edge from-layer="14" from-port="1" to-layer="15" to-port="0" />
		<edge from-layer="15" from-port="1" to-layer="16" to-port="0" />
		<edge from-layer="16" from-port="1" to-layer="17" to-port="0" />
		<edge from-layer="17" from-port="1" to-layer="18" to-port="0" />
		<edge from-layer="18" from-port="1" to-layer="19" to-port="0" />
		<edge from-layer="19" from-port="1" to-layer="20" to-port="0" />
		<edge from-layer="20" from-port="2" to-layer="21" to-port="0" />
		<edge from-layer="21" from-port="1" to-layer="22" to-port="0" />
		<edge from-layer="22" from-port="1" to-layer="23" to-port="0" />
		<edge from-layer="23" from-port="1" to-layer="24" to-port="0" />
		<edge from-layer="24" from-port="1" to-layer="25" to-port="0" />
		<edge from-layer="25" from-port="1" to-layer="26" to-port="0" />
		<edge from-layer="26" from-port="1" to-layer="27" to-port="0" />
		<edge from-layer="27" from-port="1" to-layer="28" to-port="0" />
		<edge from-layer="28" from-port="1" to-layer="29" to-port="0" />
		<edge from-layer="29" from-port="1" to-layer="30" to-port="0" />
		<edge from-layer="30" from-port="1" to-layer="31" to-port="0" />
		<edge from-layer="31" from-port="1" to-layer="32" to-port="0" />
		<edge from-layer="32" from-port="1" to-layer="41" to-port="0" />
		<edge from-layer="33" from-port="0" to-layer="39" to-port="0" />
		<edge from-layer="34" from-port="0" to-layer="52" to-port="1" />
		<edge from-layer="35" from-port="0" to-layer="51" to-port="1" />
		<edge from-layer="36" from-port="0" to-layer="44" to-port="1" />
		<edge from-layer="37" from-port="0" to-layer="43" to-port="1" />
		<edge from-layer="38" from-port="0" to-layer="39" to-port="1" />
		<edge from-layer="39" from-port="2" to-layer="42" to-port="1" />
		<edge from-layer="40" from-port="0" to-layer="41" to-port="1" />
		<edge from-layer="41" from-port="2" to-layer="42" to-port="0" />
		<edge from-layer="42" from-port="2" to-layer="43" to-port="0" />
		<edge from-layer="43" from-port="2" to-layer="44" to-port="0" />
		<edge from-layer="44" from-port="2" to-layer="45" to-port="0" />
		<edge from-layer="45" from-port="1" to-layer="46" to-port="0" />
		<edge from-layer="46" from-port="1" to-layer="47" to-port="0" />
		<edge from-layer="47" from-port="1" to-layer="48" to-port="0" />
		<edge from-layer="48" from-port="1" to-layer="49" to-port="0" />
		<edge from-layer="49" from-port="1" to-layer="50" to-port="0" />
		<edge from-layer="50" from-port="1" to-layer="51" to-port="0" />
		<edge from-layer="51" from-port="2" to-layer="52" to-port="0" />
	</edges>
	<statistics>
		<layer>
			<name>100</name>
			<min>-3.009727, -7.059688, -5.508558, -4.082596, -4.143034, -6.589783, -6.175519, -6.857327, -7.923289, -8.841466, -8.936116, -3.957710, -6.237579, -3.027401, -2.828040, -7.120592, -5.278276, -5.715302, -2.331741, -5.223938, -4.325700, -9.822647, -5.032179, -8.579200, -6.555127, -6.107852, -6.122340, -5.493712, -7.242967, -6.226397, -7.636698, -2.783144</min>
			<max>7.389713, 2.718473, 3.280669, 4.841223, 6.136638, 3.784939, 7.635035, 4.927556, 4.226505, 2.119374, 5.779651, 4.568123, 9.118906, 7.192046, 9.108191, 3.465524, 3.424947, 2.613723, 8.647591, 3.829704, 9.640773, 6.252982, 3.852924, 3.120724, 4.350808, 3.792612, 4.556108, 4.169086, 7.623547, 4.931172, 2.730240, 4.616573</max>
		</layer>
		<layer>
			<name>102</name>
			<min>-0.551763, -0.860498, -1.247510, -0.643129, -1.159996, -0.840116, -0.541096, -1.012726, -1.133802, -0.725828, -1.131679, -0.813533, -1.027601, -1.174243, -1.002862, -1.327412, -0.860831, -1.217774, -0.769599, -0.960172, -1.276117, -1.187027, -0.964255, -1.283585, -0.927420, -0.743876, -1.312598, -0.648663, -0.814565, -0.641043, -0.998596, -1.581124</min>
			<max>0.921278, 1.338562, 1.594209, 0.673097, 0.939876, 0.781225, 0.618083, 0.765164, 0.934091, 1.196900, 1.206094, 0.597191, 1.486376, 1.172976, 1.138942, 1.349177, 1.158382, 0.179470, 0.995433, 1.261380, 1.107152, 0.098480, 1.203809, 0.890421, 0.506452, 0.896735, 0.719522, 0.898140, 0.276993, 0.475896, 1.324952, 1.317519</max>
		</layer>
		<layer>
			<name>103</name>
			<min>-0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000</min>
			<max>0.921278, 1.338562, 1.594209, 0.673097, 0.939876, 0.781225, 0.618083, 0.765164, 0.934091, 1.196900, 1.206094, 0.597191, 1.486376, 1.172976, 1.138942, 1.349177, 1.158382, 0.179470, 0.995433, 1.261380, 1.107152, 0.098480, 1.203809, 0.890421, 0.506452, 0.896735, 0.719522, 0.898140, 0.276993, 0.475896, 1.324952, 1.317519</max>
		</layer>
		<layer>
			<name>105</name>
			<min>-4.705877, -3.743305, -2.473425, -10.559075, -5.080588, -14.930145, -7.648925, -4.355330, -4.397806, -6.204613, -3.038605, -2.643564, -3.426172, -2.474770, -2.749660, -0.633573</min>
			<max>6.819144, 1.460532, 11.955288, 3.323316, 7.167874, 5.366845, 3.341150, 5.684332, 5.277563, 9.419109, 3.979720, 6.511905, 7.468808, 4.213031, 6.818613, 10.615013</max>
		</layer>
		<layer>
			<name>106</name>
			<min>-9.689993, -11.305664, -8.757673, -13.309083, -7.391503, -14.390347, -15.578104, -4.286073, -9.676948, -16.451712, -13.400234, -17.030008, -8.557110, -11.601089, -14.163886, -13.867759, -7.828585, -5.854692, -18.632799, -10.598148, -10.150575, -12.157889, -14.645424, -9.216990, -7.194150, -8.420869, -19.832315, -11.478190, -11.104724, -8.483618, -10.783734, -9.029294, -7.629857, -9.270918, -17.482040, -10.991644, -9.006887, -10.729873, -11.453012, -14.297560, -14.724312, -16.075886, -12.708997, -7.827798, -14.587100, -20.051821, -8.255838, -12.119815, -12.669158, -10.463155, -7.334154, -14.130308, -11.254934, -9.948055, -9.624257, -14.501657, -8.007768, -10.976598, -6.274738, -6.340329, -10.311581, -6.493453, -10.119138, -9.214780</min>
			<max>8.985558, 7.771536, 3.522205, 9.093907, 8.211433, 7.453310, 7.020311, 7.496102, 4.192419, 7.275986, 2.200175, 6.158380, 3.182382, 5.142920, 5.549371, 9.548374, 8.800218, 10.796009, 4.784914, 9.913751, 7.190584, 6.859803, 8.415044, 12.308677, 4.336727, 2.660277, 3.830395, 7.231179, 8.128650, 6.645627, 6.727793, 7.799057, 9.316012, 5.031276, 2.953008, 4.188617, 6.174936, 6.385799, 9.096255, 6.164148, 5.595518, 7.569472, 9.125917, 9.753923, 7.430897, 7.081964, 5.487981, 9.660295, 5.096522, 6.556139, 9.093636, 2.629671, 4.799068, 6.580706, 7.331135, 8.900351, 6.751437, 6.691417, 6.495627, 10.026895, 5.545621, 4.375247, 6.910558, 4.377455</max>
		</layer>
		<layer>
			<name>107</name>
			<min>-0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000</min>
			<max>8.985558, 7.771536, 3.522205, 9.093907, 8.211433, 7.453310, 7.020311, 7.496102, 4.192419, 7.275986, 2.200175, 6.158380, 3.182382, 5.142920, 5.549371, 9.548374, 8.800218, 10.796009, 4.784914, 9.913751, 7.190584, 6.859803, 8.415044, 12.308677, 4.336727, 2.660277, 3.830395, 7.231179, 8.128650, 6.645627, 6.727793, 7.799057, 9.316012, 5.031276, 2.953008, 4.188617, 6.174936, 6.385799, 9.096255, 6.164148, 5.595518, 7.569472, 9.125917, 9.753923, 7.430897, 7.081964, 5.487981, 9.660295, 5.096522, 6.556139, 9.093636, 2.629671, 4.799068, 6.580706, 7.331135, 8.900351, 6.751437, 6.691417, 6.495627, 10.026895, 5.545621, 4.375247, 6.910558, 4.377455</max>
		</layer>
		<layer>
			<name>109</name>
			<min>-22.224857, -14.159434, -8.760345, -8.767082, -12.835047, -6.466552, -7.630691, -7.374675, -15.898317, -9.249054, -6.856255, -9.223619, -10.479554, -9.877192, -9.607259, -8.380517, -19.827984, -9.483341, -3.844752, -9.775043, -8.220581, -5.232117, -8.279686, -2.074180, -17.215546, -5.461660, -6.480007, -4.414790, -25.117887, -8.807897, -10.208961, -6.694974</min>
			<max>7.964493, 5.874205, 6.651376, 5.545054, 10.602963, 12.026020, 9.813516, 13.303742, 4.651148, 9.175125, 13.213105, 8.908815, 6.833934, 7.868144, 2.948044, 6.598407, 10.727470, 11.991241, 17.349133, 8.962757, 11.414340, 14.353321, 6.124957, 13.929581, 7.663442, 13.619284, 10.845780, 13.411171, 6.764496, 11.947687, 14.909656, 5.606848</max>
		</layer>
		<layer>
			<name>110</name>
			<min>-3.009727, -7.059688, -5.508558, -4.082596, -4.143034, -6.589783, -6.175519, -6.857327, -7.923289, -8.841466, -8.936116, -3.957710, -6.237579, -3.027401, -2.828040, -7.120592, -5.278276, -5.715302, -2.331741, -5.223938, -4.325700, -9.822647, -5.032179, -8.579200, -6.555127, -6.107852, -6.122340, -5.493712, -7.242967, -6.226397, -7.636698, -2.783144, -22.224857, -14.159434, -8.760345, -8.767082, -12.835047, -6.466552, -7.630691, -7.374675, -15.898317, -9.249054, -6.856255, -9.223619, -10.479554, -9.877192, -9.607259, -8.380517, -19.827984, -9.483341, -3.844752, -9.775043, -8.220581, -5.232117, -8.279686, -2.074180, -17.215546, -5.461660, -6.480007, -4.414790, -25.117887, -8.807897, -10.208961, -6.694974</min>
			<max>7.389713, 2.718473, 3.280669, 4.841223, 6.136638, 3.784939, 7.635035, 4.927556, 4.226505, 2.119374, 5.779651, 4.568123, 9.118906, 7.192046, 9.108191, 3.465524, 3.424947, 2.613723, 8.647591, 3.829704, 9.640773, 6.252982, 3.852924, 3.120724, 4.350808, 3.792612, 4.556108, 4.169086, 7.623547, 4.931172, 2.730240, 4.616573, 7.964493, 5.874205, 6.651376, 5.545054, 10.602963, 12.026020, 9.813516, 13.303742, 4.651148, 9.175125, 13.213105, 8.908815, 6.833934, 7.868144, 2.948044, 6.598407, 10.727470, 11.991241, 17.349133, 8.962757, 11.414340, 14.353321, 6.124957, 13.929581, 7.663442, 13.619284, 10.845780, 13.411171, 6.764496, 11.947687, 14.909656, 5.606848</max>
		</layer>
		<layer>
			<name>111</name>
			<min>-28.058525, -24.321865, -34.461327, -21.116539, -36.430466, -25.347391, -26.935745, -19.894711, -25.211485, -56.251888, -25.086348, -26.129456, -28.463383, -29.302752, -28.969311, -41.590061, -38.778767, -34.151619, -34.832932, -18.178953, -48.474403, -29.316559, -35.457378, -25.011587, -28.358578, -30.545971, -40.186676, -22.930571, -32.565113, -30.556366, -32.080757, -41.924477, -27.031582, -49.763077, -23.477812, -32.441868, -41.599503, -34.707878, -32.581581, -25.426407, -48.540550, -34.166527, -43.511547, -39.214294, -42.263794, -29.021057, -40.686687, -38.574749, -16.851223, -43.415878, -15.231236, -35.660801, -73.132820, -30.896664, -33.286926, -38.109253, -25.643902, -28.632486, -37.042633, -29.515339, -37.135197, -28.716640, -27.358191, -48.570221, -8.937088, -24.446686, -24.321232, -38.341873, -28.524338, -36.136547, -36.864689, -19.404352, -32.723854, -40.842815, -40.417290, -34.915810, -31.145712, -39.754623, -30.230961, -28.019508, -45.320084, -29.662109, -22.612705, -43.017082, -32.715984, -27.610680, -33.337322, -39.523552, -25.065437, -35.561661, -37.982086, -35.997688, -35.353149, -31.537380, -37.075497, -39.871895, -38.401020, -31.077007, -40.934498, -22.059309, -53.441620, -41.252434, -26.973713, -42.846611, -28.891987, -36.336037, -44.335632, -22.658062, -27.602068, -33.210567, -26.206848, -45.385227, -44.182354, -30.863277, -35.918446, -22.176550, -35.198483, -34.269527, -39.594688, -37.615410, -45.924255, -52.327858, -42.222427, -29.522911, -30.034061, -31.726446, -38.610233, -24.812862</min>
			<max>11.897610, 13.550929, 17.818022, 23.147577, 13.240596, 15.261353, 17.582785, 18.280745, 25.142498, 17.651741, 29.705427, 18.672600, 28.793768, 17.905304, 25.824718, 15.693901, 27.462223, 14.460316, 22.770557, 17.165802, 9.187019, 28.062912, 20.853191, 13.241659, 22.973381, 24.293987, 14.103961, 10.989680, 24.680096, 19.906164, 18.164724, 18.081324, 22.767593, 11.195487, 14.761625, 21.575483, 18.558838, 18.710926, 28.308527, 20.925941, 13.990944, 27.621653, 21.004843, 24.736305, 15.443991, 21.602369, 23.055656, 35.660332, 9.960249, 10.648647, 23.816608, 24.410007, 27.640938, 16.191463, 22.195271, 23.678568, 16.559647, 24.731003, 24.172575, 26.202297, 20.322128, 18.495037, 17.509087, 44.447182, 9.232669, 25.701614, 7.929355, 14.011446, 8.457120, 26.094614, 17.332527, 19.646318, 38.328014, 17.330675, 11.096188, 12.514743, 18.268501, 13.472937, 15.993633, 15.845598, 15.381081, 9.600614, 14.813133, 28.072514, 32.484482, 21.949673, 28.958353, 30.629963, 17.084803, 22.438736, 15.710847, 16.201157, 15.735716, 20.076305, 9.007507, 16.303686, 27.652458, 15.705755, 24.816032, 19.618696, 24.099590, 27.242167, 30.248585, 12.543713, 12.117952, 18.637381, 13.759874, 22.430229, 17.145506, 5.476851, 28.596664, 18.521311, 24.400967, 22.209953, 19.981821, 16.993221, 22.488926, 29.075428, 17.286127, 20.565638, 20.977060, 48.385452, 23.383593, 21.415354, 25.920090, 22.659313, 19.418818, 23.407598</max>
		</layer>
		<layer>
			<name>112</name>
			<min>-0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000</min>
			<max>11.897610, 13.550929, 17.818022, 23.147577, 13.240596, 15.261353, 17.582785, 18.280745, 25.142498, 17.651741, 29.705427, 18.672600, 28.793768, 17.905304, 25.824718, 15.693901, 27.462223, 14.460316, 22.770557, 17.165802, 9.187019, 28.062912, 20.853191, 13.241659, 22.973381, 24.293987, 14.103961, 10.989680, 24.680096, 19.906164, 18.164724, 18.081324, 22.767593, 11.195487, 14.761625, 21.575483, 18.558838, 18.710926, 28.308527, 20.925941, 13.990944, 27.621653, 21.004843, 24.736305, 15.443991, 21.602369, 23.055656, 35.660332, 9.960249, 10.648647, 23.816608, 24.410007, 27.640938, 16.191463, 22.195271, 23.678568, 16.559647, 24.731003, 24.172575, 26.202297, 20.322128, 18.495037, 17.509087, 44.447182, 9.232669, 25.701614, 7.929355, 14.011446, 8.457120, 26.094614, 17.332527, 19.646318, 38.328014, 17.330675, 11.096188, 12.514743, 18.268501, 13.472937, 15.993633, 15.845598, 15.381081, 9.600614, 14.813133, 28.072514, 32.484482, 21.949673, 28.958353, 30.629963, 17.084803, 22.438736, 15.710847, 16.201157, 15.735716, 20.076305, 9.007507, 16.303686, 27.652458, 15.705755, 24.816032, 19.618696, 24.099590, 27.242167, 30.248585, 12.543713, 12.117952, 18.637381, 13.759874, 22.430229, 17.145506, 5.476851, 28.596664, 18.521311, 24.400967, 22.209953, 19.981821, 16.993221, 22.488926, 29.075428, 17.286127, 20.565638, 20.977060, 48.385452, 23.383593, 21.415354, 25.920090, 22.659313, 19.418818, 23.407598</max>
		</layer>
		<layer>
			<name>114</name>
			<min>-8.499514, -9.371194, -7.947372, -12.756726, -6.301067, -4.702302, -8.805700, -6.972312, -7.195387, -16.442924, -7.005780, -7.976705, -14.901270, -9.799833, -6.495006, -8.579601, -17.575932, -21.413715, -5.321303, -8.022095, -7.177870, -9.296025, -9.817084, -7.477432, -5.191728, -7.963254, -8.746061, -16.836729, -7.986430, -16.822813, -6.120990, -12.586484, -9.623595, -9.330441, -5.160585, -14.406991, -12.461843, -8.164281, -2.757317, -9.019876, -7.303512, -6.618401, -12.131457, -10.533785, -3.135994, -5.666744, -28.305359, -12.771998, -8.773223, -6.105936, -11.406544, -9.755356, -10.346530, -6.939901, -7.402321, -10.586560, -4.458475, -8.578182, -6.178142, -21.325565, -7.671158, -6.568316, -10.128042, -13.603402</min>
			<max>18.700176, 9.658523, 23.243458, 4.573775, 12.556357, 8.474284, 7.696198, 13.354753, 10.308268, 7.782407, 9.722034, 7.540956, 6.572159, 9.692259, 9.266477, 15.420718, 8.519086, 6.588503, 10.196102, 11.527049, 14.718781, 7.237805, 6.513118, 7.427543, 9.607416, 14.612824, 10.334500, 6.634354, 10.024281, 4.401479, 9.061606, 5.790265, 8.019370, 6.517323, 11.345157, 3.822706, 11.086588, 8.033499, 15.445210, 15.818527, 6.177266, 14.322805, 6.755636, 9.083315, 24.312082, 11.398874, 2.384166, 9.090219, 17.449377, 7.938412, 4.802866, 11.059422, 8.505728, 8.543080, 7.016397, 7.057867, 14.513224, 7.868785, 8.178406, 4.991281, 8.616657, 5.606770, 8.061746, 7.985312</max>
		</layer>
		<layer>
			<name>115</name>
			<min>-18.535366, -42.614605, -42.753151, -31.489765, -33.770409, -42.298264, -24.394356, -33.422787, -38.467037, -55.535374, -25.990614, -17.657263, -44.293354, -32.755474, -37.989113, -10.928415, -27.836678, -29.772511, -21.868263, -43.949371, -21.341105, -42.956902, -29.693867, -40.504890, -35.908932, -26.552917, -47.355450, -39.755360, -19.923239, -35.683777, -56.130295, -36.633560, -29.588367, -33.975349, -28.380091, -19.033932, -30.040535, -31.662294, -31.805428, -36.066132, -42.479134, -30.354736, -32.913475, -51.368813, -32.428474, -28.101976, -51.283798, -44.302887, -24.915943, -49.484726, -20.962273, -35.499382, -37.737900, -35.449303, -32.038555, -34.306175, -19.682529, -42.506039, -32.430130, -26.571472, -21.906973, -34.378380, -51.375446, -48.259781, -30.406651, -31.205290, -31.258472, -37.811371, -36.992050, -31.973135, -29.769299, -52.643089, -43.151802, -40.214138, -25.751711, -31.657310, -36.101875, -29.413097, -27.561495, -39.784050, -25.859423, -27.096207, -34.070332, -24.387260, -56.374416, -43.181511, -32.703114, -39.567989, -37.251450, -29.918280, -36.542488, -25.938622, -26.444721, -38.574921, -30.144258, -20.903252, -32.200691, -34.791149, -36.861301, -52.001472, -36.778782, -36.081108, -30.796946, -30.174402, -52.704540, -21.687622, -30.422857, -28.684858, -29.079367, -57.383957, -47.102859, -25.532280, -30.314634, -51.407825, -53.235893, -28.390043, -32.567238, -29.491837, -36.821465, -39.184387, -35.039925, -31.073792, -49.475830, -34.795853, -46.599525, -39.892662, -46.218796, -20.878328</min>
			<max>22.284698, 10.409753, 13.594683, 19.856995, 20.781206, 14.811886, 9.977673, 20.455069, 16.729317, 12.409307, 26.446306, 26.087986, 15.919919, 32.877075, 14.385216, 14.104300, 10.357855, 20.396946, 21.457251, 30.061890, 17.737444, 14.162227, 28.013546, 18.678589, 43.062111, 34.867302, 13.656643, 29.558092, 20.454885, 19.627052, 8.110501, 5.774564, 24.977589, 28.451958, 30.076668, 11.971424, 18.818617, 19.005911, 16.000401, 10.730292, 17.137812, 24.387321, 29.676012, 13.969759, 17.437656, 26.599724, 16.990213, 15.789717, 20.301844, 18.058472, 15.910131, 11.900909, 22.146223, 15.249275, 18.984535, 23.908428, 23.852558, 18.159821, 27.656429, 16.428888, 16.003576, 24.935715, 15.920308, 33.029839, 25.862112, 20.964436, 23.608097, 31.259857, 11.066963, 20.586708, 13.139880, 7.478921, 23.566845, 8.613267, 12.492554, 17.134212, 30.092751, 18.781923, 7.642763, 39.479084, 11.118536, 21.912741, 21.190071, 16.843845, 28.712502, 29.498705, 14.240946, 24.487473, 13.347731, 32.403084, 27.838306, 27.599262, 9.602307, 28.339798, 15.499813, 11.381560, 17.499075, 20.738035, 10.111437, 9.041473, 18.403559, 22.117498, 27.247046, 17.978895, 15.390438, 15.711824, 23.024572, 15.245689, 32.731529, 25.802534, 40.095230, 50.226173, 11.606203, 27.151520, 12.814561, 16.786697, 26.904091, 30.791977, 7.951857, 7.088673, 15.724085, 16.159271, 13.305620, 9.563470, 32.396473, 8.669113, 12.554408, 14.851284</max>
		</layer>
		<layer>
			<name>116</name>
			<min>-0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000, -0.000000</min>
			<max>22.284698, 10.409753, 13.594683, 19.856995, 20.781206, 14.811886, 9.977673, 20.455069, 16.729317, 12.409307, 26.446306, 26.087986, 15.919919, 32.877075, 14.385216, 14.104300, 10.357855, 20.396946, 21.457251, 30.061890, 17.737444, 14.162227, 28.013546, 18.678589, 43.062111, 34.867302, 13.656643, 29.558092, 20.454885, 19.627052, 8.110501, 5.774564, 24.977589, 28.451958, 30.076668, 11.971424, 18.818617, 19.005911, 16.000401, 10.730292, 17.137812, 24.387321, 29.676012, 13.969759, 17.437656, 26.599724, 16.990213, 15.789717, 20.301844, 18.058472, 15.910131, 11.900909, 22.146223, 15.249275, 18.984535, 23.908428, 23.852558, 18.159821, 27.656429, 16.428888, 16.003576, 24.935715, 15.920308, 33.029839, 25.862112, 20.964436, 23.608097, 31.259857, 11.066963, 20.586708, 13.139880, 7.478921, 23.566845, 8.613267, 12.492554, 17.134212, 30.092751, 18.781923, 7.642763, 39.479084, 11.118536, 21.912741, 21.190071, 16.843845, 28.712502, 29.498705, 14.240946, 24.487473, 13.347731, 32.403084, 27.838306, 27.599262, 9.602307, 28.339798, 15.499813, 11.381560, 17.499075, 20.738035, 10.111437, 9.041473, 18.403559, 22.117498, 27.247046, 17.978895, 15.390438, 15.711824, 23.024572, 15.245689, 32.731529, 25.802534, 40.095230, 50.226173, 11.606203, 27.151520, 12.814561, 16.786697, 26.904091, 30.791977, 7.951857, 7.088673, 15.724085, 16.159271, 13.305620, 9.563470, 32.396473, 8.669113, 12.554408, 14.851284</max>
		</layer>
		<layer>
			<name>118</name>
			<min>-6.155570, -4.657475, -4.580344, -8.329068, -6.370782, -5.005995, -9.368190, -8.976576, -1.554205, -7.277765, -7.422884, -6.500994, -4.698698, -5.890478, -14.091790, -7.639150, -5.596987, -5.249541, -13.586082, -2.307010, -4.557665, -6.518162, -7.667553, -5.070142, -9.756432, -6.277209, -6.302270, -3.435889, -5.496254, -14.552964, -8.833387, -6.375782, -8.951647, -3.923355, -4.386197, -11.342920, -6.687384, -7.517618, -4.546874, -6.945838, -6.609854, -11.952283, -4.569053, -9.253465, -5.615031, -8.362313, -2.824845, -3.597828, -6.486750, -5.204473, -7.562996, -5.987731, -9.956005, -3.320721, -12.911446, -6.011215, -3.830554, -10.386659, -7.400305, -4.973874, -5.693892, -15.017619, -14.069279, -9.408548</min>
			<max>10.804065, 3.174748, 7.580881, 4.559122, 8.494412, 4.593924, 9.932324, 12.951334, 15.189935, 5.628384, 5.874470, 9.847930, 8.903874, 3.030471, 6.443058, 2.025826, 9.899791, 5.809091, 4.496780, 10.443893, 11.210148, 2.962285, 7.379709, 11.451462, 5.318481, 6.366852, 5.135233, 11.662001, 12.301467, 12.110692, 2.923086, 10.768156, 6.574401, 5.407088, 10.152514, 4.675025, 7.961103, 7.805968, 3.505447, 7.451373, 6.278456, 3.831163, 7.786841, 10.459555, 11.691512, 4.088282, 8.981994, 4.680218, 3.073655, 5.838786, 6.107934, 12.056317, 4.913732, 7.325596, 9.497352, 4.198852, 9.396149, 2.822977, 4.765902, 5.213150, 10.889375, 3.570372, 2.626692, 3.640456</max>
		</layer>
		<layer>
			<name>119</name>
